<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Initialize-the-Database-with-Credentials:" data-toc-modified-id="Initialize-the-Database-with-Credentials:-1">Initialize the Database with Credentials:</a></span></li><li><span><a href="#Data-Types" data-toc-modified-id="Data-Types-2">Data Types</a></span><ul class="toc-item"><li><span><a href="#mysql" data-toc-modified-id="mysql-2.1"><a href="https://dev.mysql.com/doc/refman/8.0/en/data-types.html" target="_blank">mysql</a></a></span></li><li><span><a href="#PostgreSQL" data-toc-modified-id="PostgreSQL-2.2"><a href="https://www.postgresql.org/docs/current/datatype.html" target="_blank">PostgreSQL</a></a></span></li><li><span><a href="#Tips" data-toc-modified-id="Tips-2.3">Tips</a></span></li></ul></li><li><span><a href="#CRUD-Operations" data-toc-modified-id="CRUD-Operations-3">CRUD Operations</a></span><ul class="toc-item"><li><span><a href="#2.1.-CREATE-/-DROP-Database" data-toc-modified-id="2.1.-CREATE-/-DROP-Database-3.1">2.1. <code>CREATE</code> / <code>DROP</code> Database</a></span></li><li><span><a href="#2.2.-CREATE-/-DROP-Table" data-toc-modified-id="2.2.-CREATE-/-DROP-Table-3.2">2.2. <code>CREATE</code> / <code>DROP</code> Table</a></span></li><li><span><a href="#2.3.-CREATE-/-DROP-View" data-toc-modified-id="2.3.-CREATE-/-DROP-View-3.3">2.3. <code>CREATE</code> / <code>DROP</code> View</a></span></li><li><span><a href="#ALTER-Table-Columns" data-toc-modified-id="ALTER-Table-Columns-3.4"><code>ALTER</code> Table Columns</a></span></li><li><span><a href="#INSERT-Entries" data-toc-modified-id="INSERT-Entries-3.5"><code>INSERT</code> Entries</a></span></li><li><span><a href="#UPDATE-Entries" data-toc-modified-id="UPDATE-Entries-3.6"><code>UPDATE</code> Entries</a></span></li><li><span><a href="#DELETE-Entries" data-toc-modified-id="DELETE-Entries-3.7"><code>DELETE</code> Entries</a></span></li><li><span><a href="#TRUNCATE-vs-DELETE" data-toc-modified-id="TRUNCATE-vs-DELETE-3.8"><code>TRUNCATE</code> vs <code>DELETE</code></a></span></li><li><span><a href="#SELECT-Clauses" data-toc-modified-id="SELECT-Clauses-3.9"><code>SELECT</code> Clauses</a></span><ul class="toc-item"><li><span><a href="#Simple-select" data-toc-modified-id="Simple-select-3.9.1">Simple select</a></span></li><li><span><a href="#WITH-Clause" data-toc-modified-id="WITH-Clause-3.9.2">WITH Clause</a></span></li><li><span><a href="#Case-Clause" data-toc-modified-id="Case-Clause-3.9.3">Case Clause</a></span></li><li><span><a href="#EXIST-Clause" data-toc-modified-id="EXIST-Clause-3.9.4">EXIST Clause</a></span></li></ul></li></ul></li><li><span><a href="#Subquery" data-toc-modified-id="Subquery-4"><a href="https://dev.mysql.com/doc/refman/8.0/en/subqueries.html" target="_blank">Subquery</a></a></span></li><li><span><a href="#JOIN,-UNION,-MERGE" data-toc-modified-id="JOIN,-UNION,-MERGE-5">JOIN, UNION, MERGE</a></span><ul class="toc-item"><li><span><a href="#JOIN" data-toc-modified-id="JOIN-5.1">JOIN</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#-INNER-JOIN" data-toc-modified-id="-INNER-JOIN-5.1.0.1"><b style="font-size: 18px ; color: #c71585"> INNER JOIN</b></a></span></li><li><span><a href="#NATURAL-JOIN" data-toc-modified-id="NATURAL-JOIN-5.1.0.2"><b style="font-size: 18px ; color: #c71585">NATURAL JOIN</b></a></span></li><li><span><a href="#SELF-JOIN" data-toc-modified-id="SELF-JOIN-5.1.0.3"><b style="font-size: 18px ; color: #c71585">SELF JOIN</b></a></span></li><li><span><a href="#LEFT-JOIN" data-toc-modified-id="LEFT-JOIN-5.1.0.4"><b style="font-size: 18px ; color: #c71585">LEFT JOIN</b></a></span></li><li><span><a href="#RIGHT-JOIN" data-toc-modified-id="RIGHT-JOIN-5.1.0.5"><b style="font-size: 18px ; color: #c71585">RIGHT JOIN</b></a></span></li><li><span><a href="#FULL-JOIN" data-toc-modified-id="FULL-JOIN-5.1.0.6"><b style="font-size: 18px ; color: #c71585">FULL JOIN</b></a></span></li><li><span><a href="#OUTER-JOIN" data-toc-modified-id="OUTER-JOIN-5.1.0.7"><b style="font-size: 18px ; color: #c71585">OUTER JOIN</b></a></span></li><li><span><a href="#CROSS-JOIN-(Cartesian-product-)" data-toc-modified-id="CROSS-JOIN-(Cartesian-product-)-5.1.0.8"><b style="font-size: 18px ; color: #c71585">CROSS JOIN </b>(Cartesian product )</a></span></li></ul></li></ul></li><li><span><a href="#UNION-(Stacking-Data-from-Multiple-Tables)" data-toc-modified-id="UNION-(Stacking-Data-from-Multiple-Tables)-5.2">UNION (Stacking Data from Multiple Tables)</a></span></li></ul></li><li><span><a href="#Relationship" data-toc-modified-id="Relationship-6">Relationship</a></span></li><li><span><a href="#Index" data-toc-modified-id="Index-7">Index</a></span></li><li><span><a href="#Views" data-toc-modified-id="Views-8">Views</a></span></li><li><span><a href="#Partition" data-toc-modified-id="Partition-9">Partition</a></span></li><li><span><a href="#Built-in-Functions-and-Operators---mysql" data-toc-modified-id="Built-in-Functions-and-Operators---mysql-10">Built-in Functions and Operators - <a href="https://dev.mysql.com/doc/refman/8.0/en/functions.html" target="_blank">mysql</a></a></span><ul class="toc-item"><li><span><a href="#Window-Functions" data-toc-modified-id="Window-Functions-10.1"><a href="https://dev.mysql.com/doc/refman/8.0/en/window-functions.html" target="_blank">Window Functions</a></a></span></li><li><span><a href="#Grouping-sets,-rollup,-and-cube" data-toc-modified-id="Grouping-sets,-rollup,-and-cube-10.2">Grouping sets, rollup, and cube</a></span><ul class="toc-item"><li><span><a href="#-rank(...)-/-dense_rnk(...)-/-row_number(...):" data-toc-modified-id="-rank(...)-/-dense_rnk(...)-/-row_number(...):-10.2.1"> rank(...) / dense_rnk(...) / row_number(...):</a></span></li><li><span><a href="#-lead()-/-lag():" data-toc-modified-id="-lead()-/-lag():-10.2.2"> lead() / lag():</a></span></li><li><span><a href="#-FIRST_VALUE():" data-toc-modified-id="-FIRST_VALUE():-10.2.3"> FIRST_VALUE():</a></span></li><li><span><a href="#-LAST_VALUE():" data-toc-modified-id="-LAST_VALUE():-10.2.4"> LAST_VALUE():</a></span></li><li><span><a href="#-NTH_VALUE():" data-toc-modified-id="-NTH_VALUE():-10.2.5"> NTH_VALUE():</a></span></li><li><span><a href="#-NTILE():" data-toc-modified-id="-NTILE():-10.2.6"> NTILE():</a></span></li><li><span><a href="#-CUME_DIST(...)-(cumulative-distribution):" data-toc-modified-id="-CUME_DIST(...)-(cumulative-distribution):-10.2.7"> CUME_DIST(...) (cumulative distribution):</a></span></li></ul></li><li><span><a href="#Aggregate-Function-Descriptions" data-toc-modified-id="Aggregate-Function-Descriptions-10.3"><a href="https://dev.mysql.com/doc/refman/8.0/en/aggregate-functions.html" target="_blank">Aggregate Function Descriptions</a></a></span></li><li><span><a href="#Numeric-Functions-and-Operators" data-toc-modified-id="Numeric-Functions-and-Operators-10.4"><a href="https://dev.mysql.com/doc/refman/8.0/en/numeric-functions.html" target="_blank">Numeric Functions and Operators</a></a></span></li><li><span><a href="#String-Functions-and-Operators" data-toc-modified-id="String-Functions-and-Operators-10.5"><a href="https://dev.mysql.com/doc/refman/8.0/en/string-functions.html" target="_blank">String Functions and Operators</a></a></span></li><li><span><a href="#Date-and-Time-Functions" data-toc-modified-id="Date-and-Time-Functions-10.6"><a href="https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html" target="_blank">Date and Time Functions</a></a></span></li></ul></li><li><span><a href="#Database-Administration" data-toc-modified-id="Database-Administration-11">Database Administration</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Stored-Procedure" data-toc-modified-id="Stored-Procedure-11.0.1">Stored Procedure</a></span></li><li><span><a href="#Trigger" data-toc-modified-id="Trigger-11.0.2">Trigger</a></span></li><li><span><a href="#Cursore" data-toc-modified-id="Cursore-11.0.3">Cursore</a></span></li><li><span><a href="#TRANSACTION" data-toc-modified-id="TRANSACTION-11.0.4">TRANSACTION</a></span></li><li><span><a href="#SAVEPOINT" data-toc-modified-id="SAVEPOINT-11.0.5">SAVEPOINT</a></span></li><li><span><a href="#COMMIT" data-toc-modified-id="COMMIT-11.0.6">COMMIT</a></span></li></ul></li></ul></li><li><span><a href="#MISC" data-toc-modified-id="MISC-12">MISC</a></span><ul class="toc-item"><li><span><a href="#Connect-DB-Programatically" data-toc-modified-id="Connect-DB-Programatically-12.1">Connect DB Programatically</a></span></li><li><span><a href="#5.1.-Basic-structure-of-DB-API" data-toc-modified-id="5.1.-Basic-structure-of-DB-API-12.2">5.1. Basic structure of DB-API</a></span></li><li><span><a href="#5.2.-Select-and-insert-with-SQLite" data-toc-modified-id="5.2.-Select-and-insert-with-SQLite-12.3">5.2. Select and insert with SQLite</a></span><ul class="toc-item"><li><span><a href="#SELECT" data-toc-modified-id="SELECT-12.3.1"><code>SELECT</code></a></span></li><li><span><a href="#INSERT" data-toc-modified-id="INSERT-12.3.2"><code>INSERT</code></a></span></li></ul></li><li><span><a href="#5.3.-SELECT-with-PostgreSQL" data-toc-modified-id="5.3.-SELECT-with-PostgreSQL-12.4">5.3. <code>SELECT</code> with PostgreSQL</a></span><ul class="toc-item"><li><span><a href="#SELECT" data-toc-modified-id="SELECT-12.4.1"><code>SELECT</code></a></span></li></ul></li><li><span><a href="#5.4.-SQL-injection-attack-and-script-injection-attack" data-toc-modified-id="5.4.-SQL-injection-attack-and-script-injection-attack-12.5">5.4. SQL injection attack and script injection attack</a></span><ul class="toc-item"><li><span><a href="#Solve-SQL-injection-attack" data-toc-modified-id="Solve-SQL-injection-attack-12.5.1">Solve SQL injection attack</a></span></li><li><span><a href="#Solve-script-injection-attack" data-toc-modified-id="Solve-script-injection-attack-12.5.2">Solve script injection attack</a></span></li></ul></li><li><span><a href="#5.5.-PostgreSQL-command-line" data-toc-modified-id="5.5.-PostgreSQL-command-line-12.6">5.5. PostgreSQL command line</a></span><ul class="toc-item"><li><span><a href="#Connect-to-a-database-named-forum" data-toc-modified-id="Connect-to-a-database-named-forum-12.6.1">Connect to a database named <code>forum</code></a></span></li><li><span><a href="#Get-info-about-the-database" data-toc-modified-id="Get-info-about-the-database-12.6.2">Get info about the database</a></span></li><li><span><a href="#Display-the-contents-of-a-table-named-posts-and-refresh-it-every-two-seconds" data-toc-modified-id="Display-the-contents-of-a-table-named-posts-and-refresh-it-every-two-seconds-12.6.3">Display the contents of a table named <code>posts</code> and refresh it every two seconds</a></span></li></ul></li></ul></li></ul></div>

### Setup:

<font color="red">First Login the database from command line using the following credentials.</font>

1. Start the MySQL Server:
    - `$ startmysql` 
        - `startmysql` is an alias defined in `~/.aliases` to start MySQL Server

2. MOS01:
    - `$ mysql -u Shah -p'shah711409'`
        - DB Admin User: `Shah`
        - Password: `shah711409`
    - `mysql> USE interview_questions`
        - DB Name: `interview_questions`
- MOS02:
    - `$ mysql -u A.Momin -p`
        - Database Username: `A.Momin`
        - Password: `am5202844`
    - `mysql> USE interview_questions`
        - DatabaseName: `interview_questions`

In [1]:
mysql://Shah:shah711409@localhost/IQ

In [ ]:
-- mysql://Shah:shah711409@localhost/interview_questions

In [2]:
SELECT user FROM mysql.user;

,user
0,Shah
1,mysql.infoschema
2,mysql.session
3,mysql.sys
4,root

In [ ]:
SHOW DATABASES;

In [ ]:
SHOW TABLES FROM IQ;

In [ ]:
-- DROP TABLE Employee;

In [ ]:
-- USE interview_questions;

In [ ]:
-- UPDATE mysql.user SET Password=PASSWORD('Phone#711409') WHERE User='Shah';

In [ ]:
-- SHOW TABLES FROM interview_questions;

In [ ]:
SELECT * from IQ.Title;

In [ ]:
SHOW VARIABLES LIKE '%%port%%';

### Data Types

#### [mysql](https://dev.mysql.com/doc/refman/8.0/en/data-types.html)

MySQL supports various data types, including:


- Numeric data types:
    - <b style="color:#C71585">INT</b>: A 32-bit signed integer.
    - <b style="color:#C71585">BIGINT</b>: A 64-bit signed integer.
    - <b style="color:#C71585">FLOAT</b>: A single-precision floating-point number.
    - <b style="color:#C71585">DOUBLE</b>: A double-precision floating-point number.
    - <b style="color:#C71585">DECIMAL</b>: Fixed-point decimal numbers with user-specified precision and scale.

- Date and time data types:
    - <b style="color:#C71585">DATE</b>: A date value (year, month, day).
    - <b style="color:#C71585">TIME</b>: A time value (hours, minutes, seconds).
    - <b style="color:#C71585">TIMESTAMP</b>: A date and time value.
    - <b style="color:#C71585">DATETIME</b>: A combined date and time value.

- String data types:
    - <b style="color:#C71585">CHAR</b>: A fixed-length character string.
    - <b style="color:#C71585">VARCHAR</b>: A variable-length character string.
    - <b style="color:#C71585">TEXT</b>: A variable-length character string with no upper limit.
    - <b style="color:#C71585">ENUM</b>: A set of predefined string values.
    - <b style="color:#C71585">SET</b>: A set of predefined string values.

- Binary data types:
    - <b style="color:#C71585">BINARY</b>: A fixed-length binary string.
    - <b style="color:#C71585">VARBINARY</b>: A variable-length binary string.
    - <b style="color:#C71585">BLOB</b>: A variable-length binary string with no upper limit.

- Spatial data types:
    - <b style="color:#C71585">GEOMETRY</b>: A spatial data type that represents geometric objects.
    - <b style="color:#C71585">POINT</b>: A point in a two-dimensional space.
    - <b style="color:#C71585">LINESTRING</b>: A line in a two-dimensional space.
    - <b style="color:#C71585">POLYGON</b>: A polygon in a two-dimensional space.
    - <b style="color:#C71585">JSON</b>: A data type for storing JSON (JavaScript Object Notation) data.

- Boolean data type: A Boolean data type represents true or false values.

#### [PostgreSQL](https://www.postgresql.org/docs/current/datatype.html)

PostgreSQL supports various data types, including:

- Boolean: The Boolean data type represents true or false values.

- Character types:

    - <b style="color:#C71585">CHAR</b>: A fixed-length character string.
    - <b style="color:#C71585">VARCHAR</b>: A variable-length character string.
    - <b style="color:#C71585">TEXT</b>: A variable-length character string with no upper limit.
- Numeric types:
    - <b style="color:#C71585">INTEGER</b>: A 32-bit signed integer.
    - <b style="color:#C71585">BIGINT</b>: A 64-bit signed integer.
    - <b style="color:#C71585">DECIMAL/NUMERIC</b>: Fixed-point numbers with user-specified precision and scale.
    - <b style="color:#C71585">FLOAT/REAL</b>: Single-precision floating-point numbers.
    - <b style="color:#C71585">DOUBLE PRECISION</b>: Double-precision floating-point numbers.
- Date/Time types:
    - <b style="color:#C71585">DATE</b>: A date value (year, month, day).
    - <b style="color:#C71585">TIME</b>: A time value (hours, minutes, seconds).
    - <b style="color:#C71585">TIMESTAMP</b>: A date and time value.
    - <b style="color:#C71585">INTERVAL</b>: A time interval.
- Geometric types:
    - <b style="color:#C71585">POINT</b>: A point in a two-dimensional plane.
    - <b style="color:#C71585">LINE</b>: A straight line in a two-dimensional plane.
    - <b style="color:#C71585">CIRCLE</b>: A circle in a two-dimensional plane.
    - <b style="color:#C71585">BOX</b>: A rectangular box in a two-dimensional plane.
- Network types:
    - <b style="color:#C71585">INET</b>: An IP version 4 or 6 network address.
    - <b style="color:#C71585">CIDR</b>: A network address with a subnet mask.
    - <b style="color:#C71585">MACADDR</b>: A Media Access Control address.
- <b style="color:#C71585">Arrays</b>: An array is a collection of values of the same data type.

- <b style="color:#C71585">JSON</b>: A data type for storing JSON (JavaScript Object Notation) data.

- <b style="color:#C71585">UUID</b>: A universally unique identifier data type.

- <b style="color:#C71585">XML</b>: A data type for storing XML (Extensible Markup Language) data.

#### Tips

- Table names are usually singular
- Column name with special characters: `` table1.`col name @#$%7` ``

- Wildcard:
  - `'%'`: match >=1 letter, e.g., `'JO%'` -> `'JOLIAN'`, `'JOLI'`, `'JOSEPH'`
  - `'_'`: match just 1 letter, e.g., `'_AN'` -> `'DAN'`, `'MAN'`

MySQL supports several wildcard characters that can be used in conjunction with the `LIKE` and `REGEXP` operators to perform pattern matching in queries. The following are the wildcard characters supported by MySQL:

- The percent sign (`%`): This represents zero or more characters in a string.
    - Example: `SELECT * FROM customers WHERE name LIKE '%John%';` This query will return all customers whose name contains the string "John".

- The underscore (`_`) : This represents a single character in a string.
    - Example: `SELECT * FROM customers WHERE name LIKE 'J_n';` This query will return all customers whose name starts with "J" and ends with "n", with any single character in between.

- The square brackets (`[]`): This is used to specify a range of characters to match.
    - Example: `SELECT * FROM customers WHERE name LIKE '[AJ]%';` This query will return all customers whose name starts with either "A" or "J".

- The caret (`^`): This is used to negate a character range.
    - Example: `SELECT * FROM customers WHERE name LIKE '[^A]%';` This query will return all customers whose name does not start with "A".

- The vertical bar (`|`): This is used to specify alternative patterns.
    - Example: `SELECT * FROM customers WHERE name REGEXP 'John|James';` This query will return all customers whose name matches either "John" or "James".

- The period (`.`) : This is used to match any single character.
    - Example: `SELECT * FROM customers WHERE name REGEXP 'J.n';` This query will return all customers whose name starts with "J" and ends with "n", with any single character in between.

Note that the use of wildcard characters can impact query performance, especially when used with large tables or complex queries. Therefore, it is important to use them judiciously and to optimize queries as needed.

- [Database Engineering Complete Course | DBMS Complete Course](https://www.youtube.com/watch?v=iwRneX7GIGI&t=57278s)

- [PostgreSQL - SQL Commands](https://www.postgresql.org/docs/current/sql-commands.html)

- [MySQLTutorial](https://www.mysqltutorial.org/mysql-basics/)
- [Academind: SQL Crash Course for Beginners 2022 (MySQL & PostgreSQL)](https://www.youtube.com/watch?v=DWtQU8VP3Hg)

- [FreeCodeCamp: Learn PostgreSQL](https://www.youtube.com/watch?v=qw--VYLpxG4)

### CRUD Operations

#### 2.1. `CREATE` / `DROP` Database

- <b style="font-size:18px;color:#C71585"> Create and use a database</b>

  ```sql
  DROP DATABASE IF EXISTS animals_db;
  CREATE DATABASE animals_db;
  USE animals_db;
  ```

#### 2.2. `CREATE` / `DROP` Table

- <b style="font-size:18px;color:#C71585">  Basic structure</b>


  ```sql
  CREATE TABLE animals (
      name TEXT [constraints],
      species TEXT [constraints],
      birthdate DATE [constraints],
      [row constraints]);
  ```

- <b style="font-size:18px;color:#C71585">  Drop a table</b>



  ```sql
  DROP TABLE animals;
  ```

- <b style="font-size:18px;color:#C71585">  Assign primary key</b>


  Primary key must be unique.

  ```sql
  CREATE TABLE people (
      id  INTEGER(11) AUTO_INCREMENT NOT NULL,
      first_name VARCHAR(30) NOT NULL,
      has_pet BOOLEAN NOT NULL,
      pet_name VARCHAR(30),
      pet_age INTEGER(10),
      PRIMARY KEY (id));
  ```

  ```sql
  CREATE TABLE animals (
      id SERIAL PRIMARY KEY,
      name TEXT,
      birthdate DATE);
  ```

- <b style="font-size:18px;color:#C71585">  Composite Key</b> (Assign multiple columns as primary key)


When more than one column is used to define the primary key, it is called a composite key. Here is a SQL syntax to create a composite key in MySQL

  ```sql
  CREATE TABLE animals (
      postal_code TEXT,
      country TEXT,
      name TEXT,
      PRIMARY KEY (postal_code, country));
  ```

- <b style="font-size:18px;color:#C71585">  Declare relationships</b>


  Reference provides referential integrity - columns that are supposed to refer to each other are guaranteed to do so.

  ```sql
  CREATE TABLE sale (
      sku TEXT REFERENCES products (sku),
      sale_date DATE,
      count INTEGER);
  ```

- <b style="font-size:18px;color:#C71585">  Assign foreign key</b>


  A foreign key is a column or a set of columns in one table, that uniquely identifies rows in another table.

  ```sql
  CREATE TABLE animals_location (
      id INTEGER(11) AUTO_INCREMENT NOT NULL,
      location VARCHAR(30) NOT NULL,
      animal_id INTEGER(10) NOT NULL,
      PRIMARY KEY (id),
      FOREIGN KEY (animal_id) REFERENCES animals_all(id));
  ```

- The `DROP TABLE` is another `DDL` (Data Definition Language) operation. But it is not used for simply removing data from a table; it deletes the table structure from the database, along with any data stored in the table.

In [ ]:
Create table If Not Exists Employee(id int, salary int)

In [ ]:
-- SELECT * FROM Employees;

In [ ]:
DROP TABLE Employees;

#### 2.3. `CREATE` / `DROP` View

A view is a select query stored in the database in a way that lets you use it like a table. It is a virtual table.

- <b style="font-size:18px;color:#C71585">  Create a view</b>


  ```sql
  CREATE VIEW v_course_size AS
      SELECT course_id, COUNT(*) AS num
      FROM enrollment
      GROUP BY course_id;
  ```

- <b style="font-size:18px;color:#C71585">  Delete a view</b>


  ```sql
  DROP VIEW v_course_size;
  ```

#### `ALTER`

- <b style="font-size:18px;color:#C71585">  Add a column</b>


  ```sql
  ALTER TABLE programming_languages
  ADD COLUMN new_column VARCHAR(15) DEFAULT "test" AFTER mastered;
  ```

- <b style="font-size:18px;color:#C71585">  Change datatype of a column</b>


  ```sql
  ALTER TABLE actor
  MODIFY middle_name BLOB;
  ```

- <b style="font-size:18px;color:#C71585">  Delete a column</b>


  ```sql
  ALTER TABLE actor
  DROP COLUMN middle_name;
  ```

- Add Primary Key to Product Table

In [ ]:
ALTER TABLE Product
ADD product_id INT NOT NULL AUTO_INCREMENT,
ADD PRIMARY KEY (product_id);

- Reorder Columns of Product Table

In [ ]:
ALTER TABLE Product
    MODIFY COLUMN product_id INT NOT NULL FIRST,
    MODIFY COLUMN product_name CHAR(255) NOT NULL AFTER product_id,
    MODIFY COLUMN price INT AFTER product_name,
    MODIFY COLUMN product_category CHAR(255) AFTER price,
    MODIFY COLUMN BRAND CHAR(255) AFTER product_category;

In [ ]:
ALTER TABLE Employee
MODIFY COLUMN salary DECIMAL(12, 2);

In [ ]:
ALTER TABLE Employee
DROP PRIMARY KEY;

The `ALTER` statement in MySQL allows you to modify an existing table's structure, such as adding, deleting, or modifying columns, as well as altering indexes, constraints, and other table properties. Here are several common use cases of `ALTER` with examples using `Employee`, `Title`, and `Bonus` tables.

1. **Add a New Column to a Table**: Add a `hire_date` column to the `Employee` table.

   ```sql
   ALTER TABLE Employee
   ADD COLUMN hire_date DATE;
   ```

-   This adds a `hire_date` column with `DATE` datatype to the `Employee` table.

2. **Add Multiple Columns at Once**: Add `job_level` and `status` columns to the `Title` table.

   ```sql
   ALTER TABLE Title
   ADD COLUMN job_level INT,
   ADD COLUMN status VARCHAR(20);
   ```

-   This adds two new columns, `job_level` (integer) and `status` (string) to the `Title` table.

3. **Modify a Column's Data Type**: Change the `salary` column in `Employee` from `INT` to `DECIMAL(10, 2)` to accommodate salaries with decimal places.

   ```sql
   ALTER TABLE Employee
   MODIFY COLUMN salary DECIMAL(10, 2);
   ```

-   This modifies the `salary` column's data type to `DECIMAL(10,2)` to store values with two decimal places.

4. **Rename a Column**: Rename the `bonus_amount` column in `Bonus` to `annual_bonus`.

   ```sql
   ALTER TABLE Bonus
   RENAME COLUMN bonus_amount TO annual_bonus;
   ```

-   This renames the `bonus_amount` column to `annual_bonus` in the `Bonus` table.

5. **Rename the Table**: Rename the `Employee` table to `Staff`.

   ```sql
   ALTER TABLE Employee
   RENAME TO Staff;
   ```

-   This renames the `Employee` table to `Staff`.

6. **Drop a Column**: Remove the `status` column from the `Title` table.

   ```sql
   ALTER TABLE Title
   DROP COLUMN status;
   ```

-   This removes the `status` column from the `Title` table.

7. **Add a Primary Key Constraint**: Add a primary key to the `employee_id` column in the `Employee` table.

   ```sql
   ALTER TABLE Employee
   ADD PRIMARY KEY (employee_id);
   ```

-   This sets `employee_id` as the primary key in the `Employee` table.

8. **Add a Foreign Key Constraint**: Add a foreign key constraint to the `Title` table linking `employee_id` to `Employee`.

   ```sql
   ALTER TABLE Title
   ADD CONSTRAINT fk_employee_id
   FOREIGN KEY (employee_id) REFERENCES Employee(employee_id);
   ```

-   This creates a foreign key constraint on `employee_id` in the `Title` table that references the `Employee` table's `employee_id`.

9. **Add an Index**: Add an index on the `department` column in the `Employee` table to improve search performance.

   ```sql
   ALTER TABLE Employee
   ADD INDEX idx_department (department);
   ```

-   This adds an index named `idx_department` to the `department` column to speed up queries filtering by `department`.

10. **Drop a Foreign Key Constraint**: Drop the foreign key constraint `fk_employee_id` from the `Title` table.

   ```sql
   ALTER TABLE Title
   DROP FOREIGN KEY fk_employee_id;
   ```

-   This removes the foreign key constraint `fk_employee_id` from the `Title` table.

11. **Drop an Index**: Drop the `idx_department` index from the `Employee` table.

   ```sql
   ALTER TABLE Employee
   DROP INDEX idx_department;
   ```

-   This removes the index named `idx_department` from the `Employee` table.

12. **Set a Default Value for a Column**: Set a default value of `0` for the `bonus_amount` column in the `Bonus` table.

   ```sql
   ALTER TABLE Bonus
   MODIFY COLUMN bonus_amount DECIMAL(10, 2) DEFAULT 0.00;
   ```

-   This sets a default value of `0.00` for the `bonus_amount` column in the `Bonus` table.

13. **Change a Column’s Nullability**: Modify the `department` column in `Employee` to make it `NOT NULL`.

   ```sql
   ALTER TABLE Employee
   MODIFY COLUMN department VARCHAR(50) NOT NULL;
   ```

-   This changes the `department` column to not allow null values.

14. **Modify Multiple Columns in a Single Statement**: Change `department` to `NOT NULL` and `salary` to `DEFAULT 30000` in the `Employee` table.

   ```sql
   ALTER TABLE Employee
   MODIFY COLUMN department VARCHAR(50) NOT NULL,
   MODIFY COLUMN salary DECIMAL(10, 2) DEFAULT 30000.00;
   ```

-   This statement modifies two columns: it sets `department` to `NOT NULL` and sets the default value of `salary` to `30000.00`.

15. **Convert a Column to `AUTO_INCREMENT`**: Set the `employee_id` column in `Employee` as an `AUTO_INCREMENT` primary key.

   ```sql
   ALTER TABLE Employee
   MODIFY COLUMN employee_id INT AUTO_INCREMENT;
   ```

-   This sets `employee_id` to `AUTO_INCREMENT`, which automatically increments its value with each new record.

16. **Change a Column’s Position in a Table**: Move the `department` column in `Employee` to appear right after the `employee_id` column.

   ```sql
   ALTER TABLE Employee
   MODIFY COLUMN department VARCHAR(50) AFTER employee_id;
   ```

-   This repositions the `department` column to appear immediately after the `employee_id` column.

17. **Add a UNIQUE Constraint**: Add a unique constraint on the `name` column in the `Employee` table to ensure names are unique.

   ```sql
   ALTER TABLE Employee
   ADD CONSTRAINT unique_name UNIQUE (name);
   ```

-   This adds a unique constraint to ensure that each `name` value in the `Employee` table is unique.

18. **Rename an Index**: Rename the `idx_department` index in `Employee` to `idx_dept`.

   ```sql
   ALTER TABLE Employee
   RENAME INDEX idx_department TO idx_dept;
   ```

-   This renames the index `idx_department` to `idx_dept`.

19. **Change Storage Engine**: Change the storage engine of the `Bonus` table to `InnoDB`.

   ```sql
   ALTER TABLE Bonus
   ENGINE = InnoDB;
   ```

-   This changes the storage engine of the `Bonus` table to `InnoDB`.

20. **Add a Check Constraint (MySQL 8.0+ only)**: Ensure that the `salary` in `Employee` is always greater than 0.

   ```sql
   ALTER TABLE Employee
   ADD CONSTRAINT chk_salary_positive CHECK (salary > 0);
   ```

-   This adds a `CHECK` constraint to ensure that all values in the `salary` column are positive.

#### `UPDATE` Entries

- <b style="font-size:18px">  Update entries</b>


  ```sql
  UPDATE animals SET name = 'cheese' WHERE name LIKE '%awful%';
  ```

The `UPDATE` statement in MySQL is used to modify data within existing rows in a table. It can update single or multiple columns based on conditions, incorporate joins, and use various functions.


1. **Update a Single Column Based on a Condition**: Increase salaries for all employees in the `Finance` department by 10%.

   ```sql
   UPDATE Employee
   SET salary = salary * 1.10
   WHERE department = 'Finance';
   ```

    -   This updates the `salary` column for employees in the `Finance` department, increasing it by 10%.

2. **Update Multiple Columns at Once**: Change the department and salary for an employee with `employee_id = 101`.

   ```sql
   UPDATE Employee
   SET department = 'Admin', salary = 55000
   WHERE employee_id = 101;
   ```

    -   This sets the `department` to `Admin` and `salary` to `55000` for the employee with `employee_id = 101`.

3. **Update Using a Subquery**: Set the `salary` of an employee to the average salary of all employees in their department.

   ```sql
   UPDATE Employee AS e
   SET e.salary = (
       SELECT AVG(salary) FROM Employee WHERE department = e.department
   )
   WHERE e.employee_id = 102;
   ```

    -   This updates the salary of the employee with `employee_id = 102` to the average salary within their department.

4. **Update with `JOIN`**: Update `Employee` salaries based on `Bonus` table data. If an employee has a bonus, increase their salary by the bonus amount.

   ```sql
   UPDATE Employee AS e
   JOIN Bonus AS b ON e.employee_id = b.employee_id
   SET e.salary = e.salary + b.bonus_amount;
   ```

    -   This joins `Employee` and `Bonus` tables to increase each employee's salary by their `bonus_amount`.

5. **Conditional Update with `CASE`**: Apply different salary increases based on the department.

   ```sql
   UPDATE Employee
   SET salary = salary + 
       CASE
           WHEN department = 'HR' THEN 3000
           WHEN department = 'Finance' THEN 5000
           ELSE 2000
       END;
   ```

    -   This uses `CASE` to apply different salary increments based on the department.

6. **Update Based on a Date Condition**: Extend the `end_date` of titles in the `Title` table for active employees by one year.

   ```sql
   UPDATE Title
   SET end_date = DATE_ADD(end_date, INTERVAL 1 YEAR)
   WHERE end_date > CURDATE();
   ```

    -   This extends the `end_date` for titles that are still active (i.e., `end_date` is in the future) by one year.

7. **Reset a Column Value**: Reset all `bonus_amount` values in the `Bonus` table to zero for the current year.

   ```sql
   UPDATE Bonus
   SET bonus_amount = 0
   WHERE year = YEAR(CURDATE());
   ```

    -   This sets `bonus_amount` to zero for the current year.

8. **Update Multiple Rows Based on Multiple Conditions**: Increase salaries for employees in specific departments using multiple conditions.

   ```sql
   UPDATE Employee
   SET salary = salary * 1.15
   WHERE department IN ('HR', 'Admin');
   ```

    -   This increases salaries by 15% for employees in either `HR` or `Admin` departments.

9. **Update Using Aggregate Functions**: Set the salary of all employees to the minimum salary in their department.

   ```sql
   UPDATE Employee AS e
   JOIN (
       SELECT department, MIN(salary) AS min_salary
       FROM Employee
       GROUP BY department
   ) AS dept_min ON e.department = dept_min.department
   SET e.salary = dept_min.min_salary;
   ```

    -   This uses a subquery to join each employee's department to its minimum salary and sets the employee's salary to that minimum.

10. **Increment/Decrement a Column’s Value**: Increase the `bonus_amount` by $500 for all employees in the `Bonus` table.

   ```sql
   UPDATE Bonus
   SET bonus_amount = bonus_amount + 500;
   ```

    -   This increments each `bonus_amount` by $500.

11. **Update with String Manipulation**: Add a prefix "Mr./Ms." to employee names in the `Employee` table based on gender.

   ```sql
   UPDATE Employee
   SET name = CONCAT('Mr. ', name)
   WHERE gender = 'Male';

   UPDATE Employee
   SET name = CONCAT('Ms. ', name)
   WHERE gender = 'Female';
   ```

    -   This adds a prefix based on gender to the `name` column.

12. **Update Rows with NULL Values**: Set a default value of `0` for all `NULL` `bonus_amount` values in the `Bonus` table.

   ```sql
   UPDATE Bonus
   SET bonus_amount = 0
   WHERE bonus_amount IS NULL;
   ```

    -   This replaces all `NULL` values in `bonus_amount` with `0`.

13. **Update Using a Temporary Table**: Use a temporary table to update employee titles.

   ```sql
   CREATE TEMPORARY TABLE TempTitles AS
   SELECT employee_id, 'Manager' AS title FROM Employee WHERE department = 'HR';

   UPDATE Title AS t
   JOIN TempTitles AS tt ON t.employee_id = tt.employee_id
   SET t.title = tt.title;
   ```

    -   This creates a temporary table to update employee titles for those in the `HR` department.

14. **Bulk Update Based on a Pattern**: Change `bonus_amount` for all employees whose `employee_id` ends with "5" to a specific value.

   ```sql
   UPDATE Bonus
   SET bonus_amount = 1000
   WHERE employee_id LIKE '%5';
   ```

    -   This updates `bonus_amount` to 1000 for employees whose `employee_id` ends with "5".

15. **Update with `LIMIT` to Restrict Row Count**: Increase the salary for only the first 5 employees in alphabetical order of their names.

   ```sql
   UPDATE Employee
   SET salary = salary * 1.05
   ORDER BY name ASC
   LIMIT 5;
   ```

    -   This updates the salary for only the first 5 employees, ordered alphabetically by `name`.

16. **Conditional Update Using Subquery in `SET` Clause**: Update `salary` to be 10% higher than the average salary in each department.

   ```sql
   UPDATE Employee AS e
   SET e.salary = (
       SELECT AVG(salary) * 1.10
       FROM Employee
       WHERE department = e.department
   );
   ```

    -   This sets each employee’s salary to be 10% higher than the average salary in their department.

17. **Update Based on `EXISTS` Clause**: Set the `status` of employees to `Active` if they have a current title in the `Title` table.

   ```sql
   UPDATE Employee AS e
   SET e.status = 'Active'
   WHERE EXISTS (
       SELECT 1 FROM Title AS t
       WHERE e.employee_id = t.employee_id
         AND t.end_date IS NULL
   );
   ```

    -   This updates the `status` of employees to `Active` if they have an active title.

18. **Using `UPDATE IGNORE` to Skip Errors**: Attempt to set a unique constraint on `employee_id` while ignoring duplicate errors.

   ```sql
   UPDATE IGNORE Employee
   SET employee_id = employee_id + 1000
   WHERE employee_id < 1000;
   ```

    -   This attempts to update `employee_id` while ignoring duplicate entry errors.

#### `DELETE` Entries

- <b style="font-size:18px">  Delete entries</b>


  ```sql
  SET SQL_SAFE_UPDATES = 0;

  DELETE FROM animals
  WHERE name = 'cheese';

  SET SQL_SAFE_UPDATES = 1;
  ```

#### `TRUNCATE` vs `DELETE`

The `TRUNCATE` statement in MySQL is used to quickly delete all rows from a table without logging individual row deletions. Unlike the `DELETE` statement, which deletes rows one at a time and generates a log entry for each deleted row, `TRUNCATE` simply removes all rows from the table, resulting in faster performance, especially for large tables. Here's how to use it:


It's important to note that `TRUNCATE` is a DDL (Data Definition Language) statement, not a DML (Data Manipulation Language) statement like `DELETE`. Therefore, it cannot be rolled back using the ROLLBACK statement, and it resets any AUTO_INCREMENT columns to their starting values.

Also, keep in mind that `TRUNCATE` does not fire any triggers that might be associated with the table. If you need to execute triggers when deleting rows, you should use the `DELETE` statement instead.

In [ ]:
--  CREATE TABLE ad_accounts(
--  account_id INT, 
--  date DATETIME, 
--  account_status CHAR(15)
-- );

In [ ]:
INSERT INTO ad_accounts
(account_id, date, account_status) VALUES
(101, '2019-01-21', 'active'),
(102, '2019-01-17', 'active'),
(117, '2019-02-06', 'active'),
(106, '2019-04-28', 'fraud'),
(105, '2019-03-02', 'active'),
(110, '2019-04-28', 'fraud');

In [ ]:
select * from ad_accounts;

In [ ]:
TRUNCATE TABLE ad_accounts;

In [ ]:
select * from ad_accounts;

#### `INSERT` Entries

- <b style="font-size:18px">  Insert one entry</b>


  ```sql
  INSERT INTO people(first_name, has_pet, pet_name, pet_age)
  VALUES ("Dan", true, "Rocky", 400);
  ```

- <b style="font-size:18px">  Insert multiple entries</b>


  ```sql
  INSERT INTO people(first_name, has_pet, pet_name, pet_age)
  VALUES ("Dan", true, "Rocky", 400), 
         ("Dan", true, "Rocky", 400), 
         ("Dan", true, "Rocky", 400);
  ```

- <b style="font-size:18px">  If values have same order as columns and start from the first column</b>


  ```sql
  INSERT INTO people
  VALUES ("Dan", true, "Rocky", 400);
  ```

#### `SELECT` Clauses

**SELECT** _columns_ **FROM** _tables_ **WHERE** _conditions_ **;**

- Columns are separated by commas; use \* to select all columns.
- The condition is Boolean (`and`, `or`, `not`). [DeMorgan's Law](https://en.wikipedia.org/wiki/De_Morgan%27s_laws)
- Comparison operators (`=`, `!=`/`<>`, `<`, `>=`, etc.)

In [ ]:
SELECT * FROM Employee LIMIT 5;

In [ ]:
SELECT * from interview_questions.Employee LIMIT 5;

In [ ]:

SELECT department, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM Employee
-- WHERE JOINING_DATE BETWEEN '2017-01-01' AND '2017-06-31'
WHERE department IN ('HR', 'IT', 'Finance')
GROUP BY department
HAVING AVG(salary) > 30000
ORDER BY avg_salary DESC
LIMIT 5;

In [ ]:
SELECT * FROM information_schema.statistics LIMIT 5;

###### <b style="font-size:18px;color:#C71585">  Order by</b>

In [ ]:
select * from employee
where salary > 50000
ORDER by salary ASC limit 5;

###### <b style="font-size:18px;color:#C71585">  Group by</b>

```sql
SELECT employee_id, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM Employee
WHERE department IN ('HR', 'Admin', 'Finance')
GROUP BY department;
```

-   ERROR: <b style="color:red">Expression #1 of SELECT list is not in GROUP BY clause and contains nonaggregated column 'iq.Employee.EMPLOYEE_ID' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by</b>

```sql
select department, count(*) as emp_count from employee
where salary > 50000
GROUP by department
ORDER by salary ASC limit 5;
```
-   ERROR: <b style="color:red">Expression #1 of ORDER BY clause is not in GROUP BY clause and contains nonaggregated column 'iq.employee.SALARY' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by</b>

In [ ]:
SELECT department, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM Employee
WHERE department IN ('HR', 'IT', 'Finance')
GROUP BY department;

In [ ]:
SELECT department, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM Employee
WHERE department IN ('HR', 'IT', 'Finance')
GROUP BY department, salary limit 5;

- `HAVING`:
    - `WHERE` is a restriction on the source tables
    - `HAVING` is a restriction on the results, after aggregation

In [ ]:
SELECT department, COUNT(*) AS num_employees, AVG(salary) AS avg_salary
FROM Employee
GROUP BY department
HAVING AVG(salary) > 60000
ORDER BY avg_salary DESC LIMIT 5;

###### <b style="font-size:18px;color:#C71585">  Where</b>

 - `IN`:

In [ ]:
SELECT * FROM employee
WHERE department IN ("Hr", "sales") limit 5;

In [ ]:
SELECT first_name, department, ('James' IN (first_name)) as James
FROM Employee
WHERE department IN ('HR', 'Admin', 'Finance');

- Multiple inputs

    ```sql
    SELECT *
    FROM film
    WHERE length IN (
        SELECT MAX(length), MIN(length)
        FROM film
    );
    ```

- Single input

    ```sql
    SELECT *
    FROM film
    WHERE length = (
        SELECT MAX(length)
        FROM film
    );
    ```

- `BETWEEN ... AND ...` (inclusive)

In [ ]:

SELECT * FROM employee
WHERE salary BETWEEN 10000 AND 30000;

- `Not`, `!=`, `<>`:

In [ ]:
SELECT * FROM EMPLOYEE
WHERE DEPARTMENT = "HR" limit 5;

In [ ]:
SELECT * FROM EMPLOYEE
WHERE DEPARTMENT != "HR" limit 5;

In [ ]:
SELECT * FROM EMPLOYEE
WHERE NOT DEPARTMENT = "HR" limit 5;

- `IS NULL`: Do not use equality operators to compare NULL. E.g., `WHERE NULL = NULL` or `WHERE NULL != NULL` will return nothing.

In [ ]:
SELECT * FROM Employee
WHERE email IS NULL;

In [ ]:
SELECT * FROM Employee
WHERE NOT email IS NULL limit 5;

- `ANY`, `ALL` can be applied in Where clause or Having clause

In [ ]:
SELECT * FROM employee
WHERE employee_id > ALL (SELECT EMPLOYEE_ID from employee where salary < 30000) limit 5;

In [ ]:
SELECT * FROM employee
WHERE employee_id > ANY (SELECT EMPLOYEE_ID from employee where salary < 30000) limit 5;

- `EXISTS`: The `EXISTS` keyword in MySQL is used to check for the existence of rows returned by a subquery. It returns `TRUE` if the subquery returns one or more rows and `FALSE` if it returns none.

In [ ]:
select 1 from employee where salary > 30000 limit 5;

-   Wrute a MySQL query to retrieve the first names and department IDs of employees who belong to departments that have more than five employees.

In [ ]:
with Employee as (select * from interview_questions.Employee)
SELECT e.first_name, e.department_id
FROM employee e
WHERE EXISTS (
    SELECT 1
    FROM employee e2
    WHERE e.department_id = e2.department_id
    GROUP BY e2.department_id
    HAVING COUNT(*) > 5
);

-   Write a mysql query to retrieve the first names of employees who have been hired (or joined) within the last year.

In [ ]:
SELECT first_name
FROM employee e
WHERE EXISTS (
    SELECT 1
    FROM employee e2
    WHERE e2.joining_date >= DATE_SUB(CURDATE(), INTERVAL 1 YEAR)
    AND e2.employee_id = e.employee_id
);

1. **Simple Existence Check**: Find all employees who have a bonus record in the `Bonus` table.

   ```sql
   SELECT employee_id, name
   FROM Employee
   WHERE EXISTS (
       SELECT 1
       FROM Bonus
       WHERE Bonus.employee_id = Employee.employee_id
   );
   ```

   -    This query retrieves employees who have at least one record in the `Bonus` table.

2. **Non-Existence Check**: Find all employees who do not have a title record in the `Title` table.

   ```sql
   SELECT employee_id, name
   FROM Employee
   WHERE NOT EXISTS (
       SELECT 1
       FROM Title
       WHERE Title.EMPLOYEE_REF_ID = Employee.employee_id
   );
   ```

   -    This query retrieves employees who have no records in the `Title` table.

3. **Filter by Date Conditions in a Related Table**: Find all employees who have held a title within the last 5 years.

   ```sql
   SELECT employee_id, name
   FROM Employee
   WHERE EXISTS (
       SELECT 1
       FROM Title
       WHERE Title.EMPLOYEE_REF_ID = Employee.employee_id
       AND Title.AFFECTED_FROM >= DATE_SUB(CURDATE(), INTERVAL 5 YEAR)
   );
   ```

   -    This checks if there is a record in the `Title` table where the `AFFECTED_FROM` is within the past five years for each employee.

4. **Correlated Subquery with `EXISTS`**: Find employees with a bonus greater than the average bonus for their department.

   ```sql
   SELECT employee_id, name
   FROM Employee AS e
   WHERE EXISTS (
       SELECT 1
       FROM Bonus AS b
       WHERE b.EMPLOYEE_REF_ID = e.employee_id
       AND b.bonus_amount > (
           SELECT AVG(bonus_amount)
           FROM Bonus AS b2
           JOIN Employee AS e2 ON b2.EMPLOYEE_REF_ID = e2.employee_id
           WHERE e2.department = e.department
       )
   );
   ```

   -    For each employee, this checks if there is a bonus record where the `bonus_amount` is greater than the department's average bonus.

5. **Using `EXISTS` with Joins**: Retrieve all employees who have a title and received a bonus in the same year.

   ```sql
   SELECT e.employee_id, e.first_name
   FROM Employee AS e
   WHERE EXISTS (
       SELECT 1
       FROM Title AS t
       JOIN Bonus AS b ON t.EMPLOYEE_REF_ID = b.EMPLOYEE_REF_ID
       WHERE t.EMPLOYEE_REF_ID = e.employee_id
       AND YEAR(t.AFFECTED_FROM) = b.year
   );
   ```

   -    This query retrieves employees who have both a title record and a bonus in the same year, using a join within the `EXISTS` subquery.

6. **Combining `EXISTS` with `UPDATE`**: Give a 5% raise to all employees who have never received a bonus.

   ```sql
   UPDATE Employee AS e
   SET salary = salary * 1.05
   WHERE NOT EXISTS (
       SELECT 1
       FROM Bonus AS b
       WHERE b.EMPLOYEE_REF_ID = e.employee_id
   );
   ```

   -    This query updates the `salary` of employees who do not have any records in the `Bonus` table, effectively giving a 5% raise to employees without bonuses.

7. **`DELETE` with `EXISTS`**: Delete all employees who do not have any associated title records in the `Title` table.

   ```sql
   DELETE FROM Employee
   WHERE NOT EXISTS (
       SELECT 1
       FROM Title
       WHERE Title.EMPLOYEE_REF_ID = Employee.employee_id
   );
   ```

   -    This query deletes employees who have no title records, allowing you to remove employees with no title history.

8. **Conditional Select with Nested `EXISTS`**: Find employees who received a bonus in every year that they held a title.

   ```sql
   SELECT employee_id, name
   FROM Employee AS e
   WHERE EXISTS (
       SELECT 1
       FROM Title AS t
       WHERE t.EMPLOYEE_REF_ID = e.employee_id
       AND NOT EXISTS (
           SELECT 1
           FROM Bonus AS b
           WHERE b.EMPLOYEE_REF_ID = e.employee_id
           AND b.year = YEAR(t.AFFECTED_FROM)
       )
   );
   ```

   -    This query returns employees who have a `Bonus` record for every year they have held a title, using nested `EXISTS` and `NOT EXISTS` to ensure coverage.

###### <b style="font-size:18px;color:#C71585">MISC</b>

- `LIMIT, OFFSET`:

    -   `LIMIT 10` is same as `FETCH FIRST 10 ROWS ONLY`
    -   The `OFFSET` keyword is used in conjunction with the `LIMIT` clause to skip a specified number of rows before starting to return rows in the result set. This is particularly useful for implementing pagination, where you display a subset of results on each page.

In [ ]:
SELECT * FROM Employee limit 5;

In [ ]:
SELECT * FROM Employee LIMIT 2 OFFSET 1;

- `DISTINCT`: Select unique values

In [ ]:
SELECT DISTINCT department, salary FROM Employee;

```sql
SELECT salary, DISTINCT department, FROM Employee; -- ERROR
```

-  `AS`, `LIKE`

In [ ]:
SELECT first_name, (salary > 140000) AS is_highly_paid
FROM Employee LIMIT 5;

In [ ]:
SELECT *
FROM Employee
WHERE department LIKE '%%H%%' LIMIT 5;

##### `WITH` Clause (Common Table Expression)

-   A `WITH` statement is used to create a Common Table Expression (`CTE`). A `CTE` is a temporary result set that you can reference within a larger `SELECT`, `INSERT`, `UPDATE`, or `DELETE` query. It allows you to organize complex queries, making them more readable and manageable by breaking them into smaller, logical components.
-   In SQL, including `MySQL 8.0` and later, you should use a single `WITH` clause and define multiple CTEs within it by separating them with commas.

```sql
WITH cte_name AS (
    -- Your subquery here
    SELECT ...
)
SELECT * FROM cte_name;
```

- Write a SQL query to show the last record from the employee table.

In [ ]:
SELECT COUNT(*) AS total FROM employee;

In [ ]:
SELECT *, ROW_NUMBER() OVER (ORDER BY employee_id ASC) AS row_num
FROM employee

In [ ]:
WITH record_count AS (
    SELECT COUNT(*) AS total FROM employee
)
SELECT *
FROM (
        SELECT *, ROW_NUMBER() OVER (ORDER BY employee_id ASC) AS row_num
        FROM employee
    ) AS numbered_rows
WHERE row_num = (SELECT total FROM record_count);

In [ ]:
WITH 
record_count AS (SELECT COUNT(*) AS total FROM employee),
numbered_rows as (
        SELECT *, ROW_NUMBER() OVER (ORDER BY employee_id ASC) AS row_num
        FROM employee
    )
SELECT *
FROM  numbered_rows
WHERE row_num = (SELECT total FROM record_count);

In [ ]:
select * from interview_questions.sales;

In [ ]:
WITH sales AS (
    SELECT * FROM interview_questions.sales
)
SELECT 
    s.id, 
    SUM(s.amount) AS total_sales_per_store 
FROM 
    sales s
GROUP BY 
    s.id;

- Find stores who's sales where better than the average sales accross all stores

In [ ]:
WITH total_sales AS (
    SELECT
        s.id,
        SUM(s.amount) AS total_sales_per_store
    FROM interview_questions.sales s
    GROUP BY s.id
),
avg_sales AS (
    SELECT CAST(AVG(total_sales_per_store) AS SIGNED) AS avg_sale_for_all_store
    FROM total_sales
)
SELECT 
    total_sales.id,
    total_sales.total_sales_per_store
FROM 
    total_sales
JOIN 
    avg_sales 
ON 
    total_sales.total_sales_per_store > avg_sales.avg_sale_for_all_store;

In [ ]:
SELECT 
    total_sales.id,
    total_sales.total_sales_per_store
FROM (
    SELECT
        s.id,
        SUM(s.amount) AS total_sales_per_store
    FROM interview_questions.sales s
    GROUP BY s.id
) AS total_sales
JOIN (
    SELECT CAST(AVG(total_sales_per_store) AS SIGNED) AS avg_sale_for_all_store
    FROM (
        SELECT
            s.id,
            SUM(s.amount) AS total_sales_per_store
        FROM interview_questions.sales s
        GROUP BY s.id
    ) AS x
) AS avg_sales ON total_sales.total_sales_per_store > avg_sales.avg_sale_for_all_store;

##### CTE (Common Table Expression)

The `WITH` keyword, also known as Common Table Expressions (CTEs), is used to define a temporary result set that you can reference within a query in MySQL. This approach makes complex queries more readable by breaking down parts of the query into manageable subqueries.

1. **Basic CTE for Simplifying a Query**: Find the average salary for each department and then retrieve employees earning above their department’s average salary.


   ```sql
   ```

   -    The `DepartmentAvgSalary` CTE calculates the average salary by department, and then the main query finds employees earning above the average salary in their department.

In [ ]:
WITH DepartmentAvgSalary AS (
    SELECT department, AVG(salary) AS avg_salary
    FROM Employee
    GROUP BY department
)
SELECT e.employee_id, e.first_name, e.salary, d.avg_salary
FROM Employee AS e
JOIN DepartmentAvgSalary AS d ON e.department = d.department
WHERE e.salary > d.avg_salary;


1. **Recursive CTE for Hierarchical Data**: Suppose we have a hierarchy in the `Employee` table with a `manager_id` column that references `employee_id`. We can use a recursive CTE to find all employees reporting directly or indirectly to a particular manager.
   -    This recursive CTE starts with a particular manager (in this example, with `manager_id = 1`) and recursively finds all employees who report to that manager directly or indirectly.

In [ ]:
WITH RECURSIVE EmployeeHierarchy AS (
    SELECT employee_id, first_name, manager_id
    FROM interview_questions.Employee
    WHERE manager_id = 1

    UNION ALL

    SELECT e.employee_id, e.first_name, e.manager_id
    FROM interview_questions.Employee AS e
    JOIN EmployeeHierarchy AS eh ON e.manager_id = eh.employee_id
)
SELECT * FROM EmployeeHierarchy;

##### Case Clause

- <b style="font-size:18px">  Conditional expression</b>

In [ ]:
SELECT first_name, salary,
    (CASE
        WHEN salary <=0 THEN 'Unpaid'
        WHEN salary between 0 and 60000 THEN 'Under paid'
        WHEN salary between 60000 and 70000 THEN 'Well paid'
        ELSE 'Highly Paid'
    END) AS category
FROM employee
ORDER BY salary DESC LIMIT 5;

In [ ]:
SELECT SUM(CASE WHEN salary < 100000 THEN 1 ELSE 0 END) AS under_paid,
       SUM(CASE WHEN salary >= 100000 THEN 1 ELSE 0 END) AS paid_well
FROM employee;

The `CASE` keyword in MySQL is used to create conditional expressions that allow you to apply logic within a SQL query. It’s often used in `SELECT`, `WHERE`, `ORDER BY`, and `GROUP BY` clauses, as well as in `UPDATE` and `DELETE` statements.

1. **Simple `CASE` Statement in `SELECT` Clause**: Add a new column that categorizes employees based on their salary level.

   ```sql
   SELECT employee_id, name, salary,
       CASE
           WHEN salary > 80000 THEN 'High'
           WHEN salary BETWEEN 50000 AND 80000 THEN 'Medium'
           ELSE 'Low'
       END AS salary_category
   FROM Employee;
   ```

   -    This query uses `CASE` to classify employees' salaries as `High`, `Medium`, or `Low` based on specific salary ranges.

2. **`CASE` in `WHERE` Clause for Conditional Filtering**: Find employees who work in different departments based on specific conditions (e.g., looking at bonus amounts).

   ```sql
   SELECT employee_id, name, department
   FROM Employee
   WHERE department = 
       CASE
           WHEN (SELECT AVG(bonus_amount) FROM Bonus) > 5000 THEN 'Finance'
           ELSE 'Admin'
       END;
   ```

   -    Here, `CASE` is used in the `WHERE` clause to filter employees based on whether the average bonus amount exceeds 5000. If so, it looks in the `Finance` department; otherwise, it filters to `Admin`.

3. **`CASE` for Calculated Fields in `SELECT` Clause**: Calculate net pay for employees, applying different deductions based on their department.

   ```sql
   SELECT employee_id, name, department, salary,
       salary - 
       CASE department
           WHEN 'HR' THEN salary * 0.1
           WHEN 'Finance' THEN salary * 0.12
           ELSE salary * 0.08
       END AS net_pay
   FROM Employee;
   ```

   -    This query calculates `net_pay` by deducting a percentage of `salary` based on the department.

4. **`CASE` with Aggregate Functions in `GROUP BY`**: Group employees by salary category and calculate the average salary in each category.

   ```sql
   SELECT
       CASE
           WHEN salary > 80000 THEN 'High'
           WHEN salary BETWEEN 50000 AND 80000 THEN 'Medium'
           ELSE 'Low'
       END AS salary_category,
       COUNT(*) AS num_employees,
       AVG(salary) AS avg_salary
   FROM Employee
   GROUP BY salary_category;
   ```

   -    `CASE` categorizes each employee’s salary level, and then `GROUP BY` calculates the average salary and the number of employees in each category.

5. **`CASE` in `ORDER BY` Clause for Custom Sorting**: Sort employees, prioritizing those in `Finance`, then `HR`, and then others.

   ```sql
   SELECT employee_id, name, department, salary
   FROM Employee
   ORDER BY
       CASE department
           WHEN 'Finance' THEN 1
           WHEN 'HR' THEN 2
           ELSE 3
       END, salary DESC;
   ```

   -    This query sorts employees by department priority (`Finance` first, `HR` second) and then by salary in descending order within each group.

6. **Using `CASE` in an `UPDATE` Statement**: Give a raise to employees based on their department, with different raise percentages.

   ```sql
   UPDATE Employee
   SET salary = salary +
       CASE department
           WHEN 'HR' THEN salary * 0.05
           WHEN 'Finance' THEN salary * 0.07
           ELSE salary * 0.03
       END;
   ```

   -    This updates employee salaries by applying a raise based on department, with `HR` getting a 5% raise, `Finance` a 7% raise, and other departments a 3% raise.

7. **Using `CASE` in a `DELETE` Statement**: Remove records of employees who have a salary below a certain threshold, with different thresholds for each department.

   ```sql
   DELETE FROM Employee
   WHERE salary <
       CASE department
           WHEN 'HR' THEN 40000
           WHEN 'Finance' THEN 50000
           ELSE 30000
       END;
   ```

   -    This deletes employees based on different minimum salary thresholds per department.

8. **Nested `CASE` Statements**: Classify employees based on both their salary and department, with nested conditions.

   ```sql
   SELECT employee_id, name, department, salary,
       CASE
           WHEN department = 'Finance' THEN
               CASE
                   WHEN salary > 90000 THEN 'High Finance'
                   ELSE 'Regular Finance'
               END
           WHEN department = 'HR' THEN
               CASE
                   WHEN salary > 60000 THEN 'High HR'
                   ELSE 'Regular HR'
               END
           ELSE 'Other Departments'
       END AS category
   FROM Employee;
   ```

   -    This nested `CASE` first checks the department, then applies specific conditions based on salary within each department.

9. **`CASE` for Dynamic Column Values in Joins**: Retrieve employee titles by joining `Employee` and `Title` tables, but if an employee’s title is missing, default to "No Title Assigned."

   ```sql
   SELECT e.employee_id, e.name,
       CASE
           WHEN t.title IS NOT NULL THEN t.title
           ELSE 'No Title Assigned'
       END AS current_title
   FROM Employee AS e
   LEFT JOIN Title AS t ON e.employee_id = t.employee_id AND t.end_date IS NULL;
   ```

   -    This query uses a `LEFT JOIN` to check for an active title, defaulting to "No Title Assigned" if no title record is found.

10. **Using `CASE` in Conditional Aggregation**: Count the number of employees by department who have received a bonus, marking those who haven't with a 0.

   ```sql
   SELECT department,
       COUNT(CASE WHEN b.employee_id IS NOT NULL THEN 1 END) AS employees_with_bonus,
       COUNT(CASE WHEN b.employee_id IS NULL THEN 1 END) AS employees_without_bonus
   FROM Employee AS e
   LEFT JOIN Bonus AS b ON e.employee_id = b.employee_id
   GROUP BY department;
   ```

   -    This query counts employees who have or have not received a bonus in each department using `CASE` within aggregation.

### [Subquery](https://dev.mysql.com/doc/refman/8.0/en/subqueries.html)

- [Scalar Subqueries](https://www.postgresql.org/docs/9.4/static/sql-expressions.html#SQL-SYNTAX-SCALAR-SUBQUERIES)
- [Subquery Expressions](https://www.postgresql.org/docs/9.4/static/functions-subquery.html)
- [FROM Clause](https://www.postgresql.org/docs/9.4/static/sql-select.html#SQL-FROM)


- <b style="font-size:18px;color:#C71585">Correlated subquery</b>

  - The inner query uses information returned from the outer query. Subquery is checked for every single record in the outer query. Can be very slow.

In [ ]:
-- Retrieves the employees who earn more than the average salary within their department.
SELECT first_name, salary, department
FROM employee AS e1
WHERE salary > (
    SELECT AVG(salary)
    FROM employee AS e2
    WHERE e1.department = e2.department
    )

1. **Outer Query Initialization**: The main query (`SELECT first_name, salary FROM employee AS e1`) is prepared, and a loop is set up to iterate over each row in the `employee` table (aliased as `e1`). 

2. **Inner Query Execution for Each Outer Row (Correlated Subquery)**:

    -   For each row in `e1`:
        - The subquery (`SELECT AVG(salary) FROM employee AS e2 WHERE e1.department = e2.department`) is executed.
        - Since the subquery references `e1.department`, the database treats it as a *correlated subquery*, meaning it must compute the average salary based on the current `e1.department` value.
        - The subquery performs the following steps:
            - Filters all rows in `employee` (`e2`) where `e2.department` matches the current department of `e1`.
            - Computes the average salary of these filtered rows.
    - The result of the subquery (average department salary) is passed back to the main query.

3. **Comparison and Filtering**: For each row in `e1`, the database engine compares the `salary` of that row with the average salary returned by the subquery for the matching department:

    - If the `salary` is greater than the department's average salary, the row is kept for the result set.
    - If not, the row is discarded.

4. **Optimizations the Database Might Use**: To speed up execution, database engines use various optimizations:
    - **Caching Subquery Results**: For departments with many employees, the database might cache the result of the inner subquery to avoid recalculating the average salary multiple times.
    - **Indexing**: If there is an index on the `department` column, it can speed up the filtering process, as the database can quickly find employees in the same department.
    - **Hash Join or Nested Loop**: The database may use advanced joining techniques (like hash joins or nested loops) to efficiently link data between the outer and inner queries.

In [ ]:
-- Optimized: Retrieves the employees who earn more than the average salary within their department.

WITH department_avg_salary AS (
    SELECT department, AVG(salary) AS avg_salary
    FROM employee
    GROUP BY department
)
SELECT e1.employee_id, e1.first_name, e1.salary, e1.department
FROM employee AS e1
JOIN department_avg_salary AS das ON e1.department = das.department
WHERE e1.salary > das.avg_salary;

```sql
WITH department_avg_salary AS (
    SELECT department, AVG(salary) AS avg_salary
    FROM employee
    GROUP BY department
)
SELECT e1.employee_id, e1.first_name, e1.salary, e1.department
FROM employee AS e1
WHERE e1.salary >= department_avg_salary.avg_salary;
```

<b style="color:red">Unknown column 'department_avg_salary.avg_salary' in 'where clause</b>

### JOIN, UNION, MERGE

- [mysql - join clause](https://dev.mysql.com/doc/refman/8.0/en/join.html)

#### JOIN

- ![Join Diagram](../assets/sql/SQL_JOINS_DIAGRAM.jpg)

###### <b style="font-size:18px;color:#C71585"> INNER JOIN</b>

An inner join returns only the rows from both tables that satisfy the join condition.

-   The `INNER JOIN` is a more general type of join that requires an explicit condition to be specified for joining rows from two tables.
-   The join condition is explicitly specified after the `ON` keyword, and it can involve any comparison or combination of columns from both tables.
-   `INNER JOIN` returns only the rows for which there is a match based on the specified condition.
-   `INNER JOIN` provides more flexibility, allowing for custom join conditions, but it requires explicit declaration.

In [ ]:
SELECT e.EMPLOYEE_ID, e.FIRST_NAME, b.BONUS_DATE
FROM Employee e
INNER JOIN Bonus b ON e.EMPLOYEE_ID = b.EMPLOYEE_REF_ID LIMIT 5;

In [ ]:
select * from Enrollment;

In [ ]:
SELECT * FROM Course;

In [ ]:
SELECT *
FROM Student
INNER JOIN Enrollment ON Student.STUDENT_ID = Enrollment.STUDENT_ID
INNER JOIN Course ON Enrollment.COURSE_ID = Course.COURSE_ID;

In [ ]:
select s.student_id, c.course_name
from Student s
INNER JOIN Enrollment e ON e.student_id = s.student_id
INNER JOIN Course c ON c.course_id = e.course_id;

In [ ]:
SELECT s.STUDENT_ID, s.FIRST_NAME, c.COURSE_NAME
FROM Student s
INNER JOIN Enrollment e ON s.STUDENT_ID = e.STUDENT_ID
INNER JOIN Course c ON e.COURSE_ID = c.COURSE_ID
WHERE s.FIRST_NAME LIKE '%%JOHN%%';

###### <b style="font-size:18px;color:#C71585">NATURAL JOIN</b>

The `NATURAL JOIN` is a type of join that automatically matches and combines columns with the same name from the two tables.
-   The join condition is determined based on the columns with matching names in both tables.
-   Columns with the same name but different data types may cause unexpected behavior, and it's important to ensure data consistency.
-   `NATURAL JOIN` does not require the explicit declaration of the join condition; it is inferred based on column names.

When using a NATURAL JOIN in MySQL between two tables with multiple common columns, MySQL automatically includes all these common columns in the join condition. Here’s how it works in more detail:

-   `Composite Join Condition`: NATURAL JOIN applies a composite condition across all common columns between the two tables. For a row to be included in the final result, the values in all common columns must match between the tables. For instance, if two tables share columns id and name, the join will include only rows where both id and name have identical values in both tables.
-   `De-duplication of Common Columns`: In the resulting output, each common column appears only once, avoiding redundancy. For example, if both tables have a column named id, the result will contain only one id column.
-   `Handling of Multiple Matching Rows`: If multiple rows from each table satisfy the join condition across all common columns, each combination of these rows will appear in the result (as in a typical join).

In [ ]:
SELECT *
FROM Employee
NATURAL JOIN Department;

In [ ]:
SELECT *
FROM Student
NATURAL JOIN Enrollment
NATURAL JOIN Course

###### <b style="font-size:18px;color:#C71585">SELF JOIN</b>

A **Self Join** in MySQL is a type of join operation where a table is joined with itself. This is useful when you want to compare rows within the same table or when you need to create relationships between different rows in the same table.

-   <b style="color:green">Write a SQL query to find all the employees from employee table who are also managers.</b>
- Join on the same column name

In [ ]:
select * from interview_questions.Employee;

In [3]:
WITH Employee as (select * from interview_questions.Employee)

SELECT *
FROM Employee e1
INNER JOIN Employee e2 ON e1.manager_id = e2.employee_id;

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,AGE,SALARY,JOINING_DATE,DEPARTMENT_ID,MANAGER_ID,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,AGE,SALARY,JOINING_DATE,DEPARTMENT_ID,MANAGER_ID
0,2,John,Smith,30,60000,2024-05-27 10:35:42,1,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
1,3,James,Smith,25,55000,2024-05-27 10:35:42,1,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
2,4,Mona,Smith,28,62000,2024-05-27 10:35:42,1,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
3,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
4,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
5,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
6,8,Charlie,Brown,27,58000,2024-05-27 10:35:42,4,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
7,9,Grace,Brown,33,74000,2024-05-27 10:35:42,4,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
8,10,Bob,Williams,32,65000,2024-05-27 10:35:42,3,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
9,11,David,Williams,29,72000,2024-05-27 10:35:42,3,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
10,12,Frank,Williams,26,61000,2024-05-27 10:35:42,3,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
11,13,Nathan,Williams,32,70000,2024-05-27 10:35:42,3,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5
12,14,Henry,Jefferson,34,66000,2024-05-27 10:35:42,2,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
13,15,Jack,Jefferson,36,78000,2024-05-27 10:35:42,2,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
14,16,Kathy,Jefferson,38,80000,2024-05-27 10:35:42,2,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
15,17,Thomas,Jefferson,27,67000,2024-05-27 10:35:42,2,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
16,18,Olivia,Jefferson,30,75000,2024-05-27 10:35:42,2,6,6,Hilary,Clinton,24,52000,2024-05-27 10:35:42,1,5
17,19,Peter,Wilson,33,77000,2024-05-27 10:35:42,4,7,7,Eva,Clinton,31,63000,2024-05-27 10:35:42,1,7
18,20,Andrew,Wilson,29,69000,2024-05-27 10:35:42,4,5,5,Bill,Clinton,29,54000,2024-05-27 10:35:42,1,5

In [ ]:
SELECT e1.first_name AS employee_first_name,
    e1.last_name AS employee_last_name,
    e2.first_name AS manager_first_name,
    e2.last_name AS manager_last_name
FROM interview_questions.Employee e1
INNER JOIN interview_questions.Employee e2 ON e1.manager_id = e2.employee_id;

In [ ]:
-- 6> Write a SQL query to find all the employees from employee table who are also managers
WITH Employee as (select * from interview_questions.Employee)

select e1.first_name, e1.last_name from employee e1 
join employee e2
on e1.employee_id = e2.manager_id;

In [ ]:

WITH Employee as (select * from interview_questions.Employee)
SELECT e.FIRST_NAME AS "Employee_Name", m.FIRST_NAME AS "Manager"
FROM Employee e
JOIN Employee m ON e.MANAGER_ID = m.EMPLOYEE_ID

1. **Employee-Manager Relationship (Hierarchical Data)**: In this scenario, each employee may have a manager who is also an employee. The self-join will allow us to list employees along with their managers.

In [ ]:
SELECT 
    E1.EMPLOYEE_ID AS EmployeeID,
    E1.FIRST_NAME AS EmployeeFirstName,
    E1.LAST_NAME AS EmployeeLastName,
    E2.EMPLOYEE_ID AS ManagerID,
    E2.FIRST_NAME AS ManagerFirstName,
    E2.LAST_NAME AS ManagerLastName
FROM 
    Employee E1
LEFT JOIN 
    Employee E2 ON E1.MANAGER_ID = E2.EMPLOYEE_ID;

**Finding Products Frequently Bought Together (Cross-Reference)**: In a retail scenario, let’s say we have a table `Orders` with columns `ORDER_ID` and `PRODUCT_ID`, representing products bought in each order. We can use a self-join to identify products that were frequently bought together in the same order.

In [ ]:
CREATE TABLE Orders (
    ORDER_NUMBER INT,
    PRODUCT_ID INT
);

SELECT 
    O1.PRODUCT_ID AS Product1,
    O2.PRODUCT_ID AS Product2,
    COUNT(*) AS TimesBoughtTogether
FROM 
    Orders O1
JOIN 
    Orders O2 ON O1.ORDER_NUMBER = O2.ORDER_NUMBER
WHERE 
    O1.PRODUCT_ID < O2.PRODUCT_ID
GROUP BY 
    O1.PRODUCT_ID, O2.PRODUCT_ID
ORDER BY 
    TimesBoughtTogether DESC;


`Explanation`:
    - `O1` and `O2` represent different products bought in the same order.
    - The `WHERE` clause prevents matching a product with itself and duplicates.
    - This query identifies product pairs that are often bought together.

###### <b style="font-size:18px;color:#C71585">LEFT JOIN</b>

`LEFT JOIN` returns all rows from the left table (the first table specified in the join) and the matched rows from the right table. If there is no match, NULL values are returned for columns from the right table.

In [ ]:
SELECT e.employee_id, e.first_name, e.last_name, e.department, e.salary
FROM Employee e
LEFT JOIN Department d ON e.department = d.department_id;

###### <b style="font-size:18px;color:#C71585">RIGHT JOIN</b>

Right Join</b>: `RIGHT JOIN` returns all rows from the right table and those which are shared between the tables. If there are no matching rows in the left table, it will still return all the rows from the right table.

In [ ]:
    SELECT e.employee_id, e.first_name, e.last_name, e.department, e.salary
    FROM Employee e
    RIGHT JOIN Department d ON e.department = d.department_id;

###### <b style="font-size:18px;color:#C71585">FULL JOIN</b>

`FULL JOIN` returns all rows from both tables. If there is no match, NULL values are returned for columns from the table that lacks a matching row.

In [ ]:
SELECT e.employee_id, e.first_name, e.last_name, e.department, e.salary
FROM Employee e
FULL JOIN Department d ON e.department = d.department_id;

###### <b style="font-size:18px;color:#C71585">OUTER JOIN</b>

There are three types of outer joins: `LEFT OUTER JOIN`, `RIGHT OUTER JOIN`, and `FULL OUTER JOIN`. These joins allow you to retrieve records from one table even if there are no matching records in the other table.Let's demonstrate each type of outer join using the Employee table along with another table called Department.

-   **Left Outer Join (LEFT JOIN)**: A left outer join returns all rows from the left table (the first table specified in the JOIN clause), along with matching rows from the right table (the second table specified in the JOIN clause). If there are no matching rows in the right table, NULL values are returned for the columns from the right table.

In [ ]:
SELECT * FROM customer;

In [ ]:
SELECT * FROM salesperson;

In [ ]:
SELECT * FROM orders;

In [ ]:
SELECT *
FROM customer
LEFT JOIN orders ON customer.customer_id = orders.cust_id;

-   **Right Outer Join (RIGHT JOIN)**: A right outer join returns all rows from the right table (the second table specified in the JOIN clause), along with matching rows from the left table (the first table specified in the JOIN clause). If there are no matching rows in the left table, NULL values are returned for the columns from the left table.

In [ ]:
SELECT *
FROM customer
RIGHT JOIN orders ON customer.customer_id = orders.cust_id;

-   **Full Outer Join (FULL JOIN)**: A full outer join returns all rows from both tables, matching rows from both tables where available. If there is no match, NULL values are returned for the columns from the table that does not have a matching row. MySQL does not support full outer joins directly, but you can simulate it using a combination of left and right outer joins with UNION DISTINCT.

In [ ]:
CREATE VIEW CUST AS
SELECT *
FROM customer
LEFT JOIN orders ON customer.customer_id = orders.cust_id
UNION DISTINCT
SELECT *
FROM customer
RIGHT JOIN orders ON customer.customer_id = orders.cust_id;
-- WHERE orders.cust_id IS NULL;

In [ ]:
SELECT * from cust;

###### <b style="font-size:18px;color:#C71585">CROSS JOIN </b>(Cartesian product )

A `CROSS JOIN`, also known as a Cartesian join, is a type of join operation in SQL that returns the Cartesian product of two tables. This means that each row from the first table is combined with every row from the second table, resulting in a combination of all possible pairs of rows.

  When join is not specified, every single combination of rows between 2 tables is returned.

```sql
SELECT *
FROM employees, departments;
```

```sql
SELECT *
FROM employees CROSS JOIN department;
```

#### UNION (Stacking Data from Multiple Tables)

- <b style="font-size:18px;color:#C71585">  Union</b>


  Will eliminate duplicates

  ```sql
  SELECT department
  FROM departments
  UNION
  SELECT department
  FROM employees;
  ```

- <b style="font-size:18px;color:#C71585">  Union all</b>


  Will not eliminate duplicates

  ```sql
  SELECT department
  FROM departments
  UNION ALL
  SELECT department
  FROM employees;
  ```

- <b style="font-size:18px;color:#C71585">  Except</b>
 in PostgresQL

  Equivalent to Minus in some other databases (e.g. Oracle). Will eliminate duplicates

  ```sql
  SELECT department
  FROM employees
  EXCEPT
  SELECT department
  FROM departments;
  ```

In [ ]:
DROP VIEW IF EXISTS student_employee;

In [ ]:
-- CREATE VIEW student_employee AS
select FIRST_NAME, LAST_NAME from student
UNION
select FIRST_NAME, LAST_NAME from employee
ORDER BY FIRST_NAME;

In [ ]:
select * from student_employee;

### Relationship

-   **One-to-One (1:1) Relationship**:

    -   In a one-to-one relationship, each record in one table is related to only one record in another table, and vice versa.
    -   It is less common than other types of relationships but is useful when the data is naturally divided into distinct parts.
    -   Example:

```sql
CREATE TABLE Employee (
    EmployeeID INT PRIMARY KEY,
    EmployeeName VARCHAR(100),
    ContactID INT UNIQUE,
    FOREIGN KEY (ContactID) REFERENCES Contact(ContactID)
);

CREATE TABLE Contact (
    ContactID INT PRIMARY KEY,
    Phone VARCHAR(15),
    Email VARCHAR(100)
);
```

-   In this example, each employee has a unique contact information record.

-   **One-to-Many (1:N) Relationship**:

    -   In a one-to-many relationship, a record in one table can be related to multiple records in another table, but each record in the second table is related to only one record in the first table.
    -   It is the most common type of relationship in relational databases.
    -   Example:

```sql
CREATE TABLE Department (
    Department_ID INT PRIMARY KEY,
    DepartmentName VARCHAR(100)
);

CREATE TABLE Employee (
    EmployeeID INT PRIMARY KEY,
    EmployeeName VARCHAR(100),
    Department_ID INT,
    FOREIGN KEY (Department_ID) REFERENCES Department(Department_ID)
);
```

-   In this example, each department can have multiple employees, but each employee belongs to only one department.

-   **Many-to-Many (N:M) Relationship**:

    -   In a many-to-many relationship, records in both tables can be related to multiple records in the other table.
    -   It is implemented using a junction or associative table that connects the two related tables.

```sql
CREATE TABLE Student (
    StudentID INT PRIMARY KEY,
    StudentName VARCHAR(100)
);

CREATE TABLE Course (
    CourseID INT PRIMARY KEY,
    CourseName VARCHAR(100)
);

CREATE TABLE Enrollment (
    StudentID INT,
    CourseID INT,
    PRIMARY KEY (StudentID, CourseID),
    FOREIGN KEY (StudentID) REFERENCES Student(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Course(CourseID)
);
```

### Index

An index is a data structure that improves the speed of data retrieval operations on database tables by providing quick access to rows based on the values of certain columns. It acts like a pointer to the actual data in the table and speeds up query execution by allowing the database engine to locate rows more efficiently.

When executing this query, MySQL can utilize the `idx_department` index to quickly locate all rows in the `Employee` table where the `department` column equals `IT`, resulting in faster query execution compared to scanning the entire table. Indexes can significantly improve the performance of `SELECT`, `UPDATE`, `DELETE`, and `MERGE` statements that filter or sort data based on indexed columns. However, keep in mind that indexes also consume storage space and can slow down data modification operations (`INSERT`, `UPDATE`, `DELETE`) because MySQL needs to update the index as well.

-   `Performance Improvement`: Indexes significantly speed up data retrieval operations, such as `SELECT` queries, by reducing the number of rows that need to be scanned.
-   `Quick Lookups`: Indexes help in quickly locating data without having to search every row in a table.
-   `Selectivity`: Indexes are more effective on columns with high selectivity (unique values).
-   `Indexing Frequently Queried Columns`: Index columns that are frequently used in `WHERE` clauses, `JOIN` conditions, `ORDER BY`, and `GROUP BY` clauses.
-   `Index Maintenance`: Indexes need to be maintained, as they consume additional storage and can slow down `INSERT`, `UPDATE`, and `DELETE` operations.
-   `Over-Indexing`: Avoid over-indexing, as too many indexes can degrade write performance and increase storage usage.
-   `Index Column Width`: Use shorter column widths for indexing whenever possible to reduce storage and improve performance.

In [ ]:
select * from employee ORDER BY employee_id limit 5;

In [ ]:
SHOW INDEX FROM Title;

In [ ]:
-- DROP INDEX DEPARTMENT_ID ON Employee;

In [ ]:
-- USE interview_questions;
-- CREATE INDEX idx_department ON Employee(department);

In [ ]:
SELECT TABLE_NAME, INDEX_NAME, COLUMN_NAME
FROM information_schema.statistics
WHERE TABLE_SCHEMA = 'IQ';

In [ ]:
select * from Department;

In [ ]:
-- SELECT * FROM information_schema.statistics;

### Views

-   **Predefined Views in MySQL**: MySQL provides a set of predefined views in the `information_schema` database that contain metadata about the database objects, such as tables, columns, indexes, and privileges. These views can be queried to retrieve information about the database schema and its contents.

    -   `Information Schema Views`:
        -   Information schema views provide metadata about the database, tables, columns, and other database objects.
        -   They are used to query information about the structure of the database and its objects.
        -   Information schema views are read-only and cannot be modified.
        -   `System Views`:
            -   System views provide information about the MySQL server itself, such as server status, variables, and privileges.
            -   They are used for monitoring and administration purposes.
            -   System views are read-only and cannot be modified.
            -   Some commonly used system views in MySQL include:
                -   `TABLES`: Contains information about tables in the database.
                -   `COLUMNS`: Provides details about columns in tables.
                -   `KEY_COLUMN_USAGE`: Lists columns used in indexes.
                -   `VIEWS`: Contains information about views defined in the database.
                -   `ROUTINES`: Provides details about stored procedures and functions.
                -   `SCHEMATA`: Contains information about database schemas.
                -   `STATISTICS`: Provides index usage statistics.
                -   `USER_PRIVILEGES`: Lists privileges granted to database users.

In [ ]:
DROP VIEW IF EXISTS vw_employee_salary;

In [ ]:
CREATE VIEW vw_employee_salary AS
SELECT employee_id, first_name, last_name, salary
FROM Employee;

In [ ]:
SELECT * FROM vw_employee_salary;

### Partition


Partitioning in RDBMS (Relational Database Management System) refers to the process of splitting a large table into smaller, more manageable pieces called partitions. Each partition is treated as a separate table by the database system, and may be stored on different disk drives or even on different servers, depending on the partitioning strategy.
Partitioning is a useful technique for managing large tables in an RDBMS, but it requires careful consideration of the partitioning strategy, as well as ongoing monitoring and maintenance to ensure that partitions continue to perform as expected.

-   Partitioning has several benefits, including:

    -   `Increased query performance`: By partitioning a large table into smaller pieces, queries that access only a subset of the data can be processed more quickly.

    -   `Improved manageability`: Partitioning makes it easier to manage large tables by breaking them into smaller, more manageable pieces.

    -   `Reduced downtime`: By partitioning a table, database maintenance operations, such as backups and index rebuilds, can be performed on individual partitions rather than on the entire table, reducing downtime.

    -   `Enhanced scalability`: Partitioning allows for easier scaling of a database by allowing new partitions to be added as needed.

-   There are different types of partitioning techniques available in RDBMS, including:

    -   `Range partitioning`': This involves partitioning a table based on a range of values in a particular column, such as dates or numeric values.

    -   `List partitioning`': This involves partitioning a table based on a list of discrete values in a particular column.

    -   `Hash partitioning`': This involves partitioning a table based on the results of applying a hash function to the values in a particular column.

    -   `Composite partitioning`': This involves partitioning a table using a combination of range, list, and/or hash partitioning techniques.

Partitioning in MySQL involves splitting large tables into smaller, more manageable pieces called partitions, which can improve query performance, simplify maintenance, and provide better data organization. Here's how you can demonstrate partitioning a table in a MySQL database:

In [ ]:
DROP TABLE IF EXISTS sales_partitioned;

In [ ]:
CREATE TABLE sales_partitioned (
    id INT AUTO_INCREMENT,
    date DATE,
    amount DECIMAL(10, 2),
    region VARCHAR(50),
    PRIMARY KEY (id, date) -- Note: Primary key must include the partitioning column(s)
) PARTITION BY RANGE(YEAR(date)) (
    PARTITION p2019 VALUES LESS THAN (2020),
    PARTITION p2020 VALUES LESS THAN (2021),
    PARTITION p2021 VALUES LESS THAN (2022)
);

In [ ]:
SELECT TABLE_NAME, PARTITION_NAME
FROM information_schema.partitions
WHERE TABLE_SCHEMA = 'interview_questions';

In [ ]:
SELECT TABLE_NAME, PARTITION_NAME
FROM information_schema.partitions
WHERE TABLE_SCHEMA = 'interview_questions'
AND TABLE_NAME = 'sales_partitioned';

In [ ]:
INSERT INTO sales_partitioned (date, amount, region) VALUES
('2019-01-01', 100.00, 'North'),
('2020-05-15', 150.00, 'South'),
('2020-08-20', 200.00, 'East'),
('2021-03-10', 120.00, 'West');

In [ ]:
SELECT *
FROM sales_partitioned
WHERE date BETWEEN '2020-01-01' AND '2021-12-31';

- **how to partition an existing table in mysql database?**

```sql
-- Step 1: Backup your data (not shown here)

-- Step 2: Choose a partitioning strategy (e.g., range)
-- Step 3: Add a partitioning column (if necessary)
ALTER TABLE your_table ADD COLUMN partition_column INT;

-- Step 4: Alter the table to add partitioning
ALTER TABLE your_table
PARTITION BY RANGE (partition_column)(
    PARTITION p0 VALUES LESS THAN (100),
    PARTITION p1 VALUES LESS THAN (200),
    PARTITION p2 VALUES LESS THAN (300),
    PARTITION p3 VALUES LESS THAN (MAXVALUE)
);

-- Step 5: Reorganize the table (if necessary)

-- Step 6: Verify and test (not shown here)
```

- **How to perform Hash pertiontion?**

In [ ]:
DROP TABLE IF EXISTS sales;

In [ ]:
-- Step 1: Create the sample table
CREATE TABLE sales (
    id INT AUTO_INCREMENT PRIMARY KEY,
    product VARCHAR(50),
    date TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    amount DECIMAL(10, 2)
);

-- Step 2: Partition the table
ALTER TABLE sales
PARTITION BY HASH(id)
PARTITIONS 4;

In [ ]:
-- Step 3: Insert data
INSERT INTO sales (product, amount) VALUES
('Product A', 100.00),
('Product B', 150.00),
('Product C', 200.00),
('Product D', 250.00),
('Product E', 300.00);

In [ ]:
select * from sales;

In [ ]:
-- Step 4: Verify partitions
SELECT COUNT(DISTINCT PARTITION_NAME) AS num_partitions
FROM information_schema.partitions
WHERE TABLE_SCHEMA = 'interview_questions'
AND TABLE_NAME = 'sales';

In [ ]:
SELECT * 
FROM information_schema.partitions 
WHERE TABLE_SCHEMA = 'interview_questions' 
AND TABLE_NAME = 'sales';

-  **Composite Partition**

```sql
ALTER TABLE sales
PARTITION BY RANGE COLUMNS(date) (
    PARTITION p2019 VALUES LESS THAN ('2020-01-01'),
    PARTITION p2020 VALUES LESS THAN ('2021-01-01'),
    PARTITION p2021 VALUES LESS THAN ('2022-01-01')
)
PARTITION BY HASH(id) PARTITIONS 4;
```

### Built-in Functions and Operators - [mysql](https://dev.mysql.com/doc/refman/8.0/en/functions.html)

#### [Window Functions](https://dev.mysql.com/doc/refman/8.0/en/window-functions.html)

In MySQL, a window function is a type of function that allows you to perform calculations across a set of rows that are related to the current row. Window functions are useful when you want to calculate running totals, moving averages, or cumulative sums, among other calculations.

Window functions operate on a set of rows that is defined by an `OVER()` clause. The `OVER()` clause specifies the window or set of rows that the function should operate on. The window can be defined in various ways, such as by a specific range of rows or by a partition of rows.

In [ ]:

SELECT first_name, department,
-- COUNT(*) OVER(PARTITION BY department) dept_count
SUM(salary) OVER(PARTITION BY department) dept_total_salary
FROM employee;

In [ ]:
  SELECT first_name, joining_date, salary,
      SUM(salary) OVER(PARTITION BY joining_date RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total_of_salaries -- window frame
  FROM employee;

In [ ]:
  SELECT first_name, joining_date, salary,
  SUM(salary) OVER(ORDER BY joining_date ROWS BETWEEN 1 PRECEDING AND CURRENT ROW) AS running_total_of_salaries -- window frame
  FROM employee;

In [ ]:
  SELECT first_name, department, salary,
  RANK() OVER(PARTITION BY department ORDER BY salary DESC)
  FROM employee;

In [ ]:
SELECT first_name, department, salary,
NTILE(5) OVER(PARTITION BY department ORDER BY salary DESC) salary_bracket -- split each department evenly into 5 groups
FROM employee;

In [ ]:
SELECT first_name, department, salary,
FIRST_VALUE(salary) OVER(PARTITION BY department ORDER BY salary DESC) first_val -- use the first value for each department
FROM employee;

In [ ]:
SELECT first_name, department, salary,
    NTH_VALUE(salary, 5) OVER(PARTITION BY department ORDER BY salary DESC) fifth_val -- use the first value for each department
FROM employee;

In [ ]:
SELECT first_name, department, salary,
    LEAD(salary) OVER() next_salary -- salary of the next row
FROM employee;

In [ ]:
SELECT first_name, department, salary,
    LAG(salary) OVER() previous_salary -- salary of the previous row
FROM employee;

In [ ]:
SELECT first_name, department, salary,
    LAG(salary) OVER() previous_salary -- salary of the previous row
FROM employee;

- #### Grouping sets, rollup, and cube

  ```sql
  SELECT continent, country, city, SUM(units_sold)
  FROM sales
  GROUP BY GROUPING SETS(continent, country, city, ()); -- () requests the grand total
  ```

  Equivalently, rollup groups by each individual column and maintains the hierarchy

  ```sql
  SELECT continent, country, city, SUM(units_sold)
  FROM sales
  GROUP BY ROLLUP(continent, country, city);
  ```

  Cube groups by each combination of columns

  ```sql
  SELECT continent, country, city, SUM(units_sold)
  FROM sales
  GROUP BY CUBE(continent, country, city);
  ```

In [ ]:
select e.*, max(salary) over(partition by dept_name) as max_salary
from employee e;

In [ ]:
select * from employees limit 3;

In [ ]:
-- Fetch the first 2 employees from each department to join the company.
select * from (
	select e.*,	row_number() over(partition by department order by EMPLOYEE_ID) as rn
	from employee e) x
where x.rn < 3;

<h5> rank(...) / dense_rnk(...) / row_number(...):

In [ ]:
-- Checking the different between rank, dense_rnk and row_number window functions:
select 
    e.*,
    rank() over(partition by department order by salary desc) as rnk,
    dense_rank() over(partition by department order by salary desc) as dense_rnk,
    row_number() over(partition by department order by salary desc) as rn
from employees e limit 3;

<h5> lead() / lag():

In [ ]:
-- fetch a query to display if the salary of an employee is higher, lower or equal to the previous employee.
select e.*,
lag(salary) over(partition by department order by EMPLOYEE_ID) as prev_empl_sal,
case when e.salary > lag(salary) over(partition by department order by EMPLOYEE_ID) then 'Higher than previous employee'
     when e.salary < lag(salary) over(partition by department order by EMPLOYEE_ID) then 'Lower than previous employee'
	 when e.salary = lag(salary) over(partition by department order by EMPLOYEE_ID) then 'Same as previous employee' end as sal_range
from employees e;

In [ ]:
-- COMMIT;

In [ ]:
CREATE TABLE product
( 
    product_category varchar(255),
    brand varchar(255),
    product_name varchar(255),
    price int
);

In [ ]:
INSERT INTO product VALUES
    ('Phone', 'Apple', 'iPhone 12 Pro Max', 1300),
    ('Phone', 'Apple', 'iPhone 12 Pro', 1100),
    ('Phone', 'Apple', 'iPhone 12', 1000),
    ('Phone', 'Samsung', 'Galaxy Z Fold 3', 1800),
    ('Phone', 'Samsung', 'Galaxy Z Flip 3', 1000),
    ('Phone', 'Samsung', 'Galaxy Note 20', 1200),
    ('Phone', 'Samsung', 'Galaxy S21', 1000),
    ('Phone', 'OnePlus', 'OnePlus Nord', 300),
    ('Phone', 'OnePlus', 'OnePlus 9', 800),
    ('Phone', 'Google', 'Pixel 5', 600),
    ('Laptop', 'Apple', 'MacBook Pro 13', 2000),
    ('Laptop', 'Apple', 'MacBook Air', 1200),
    ('Laptop', 'Microsoft', 'Surface Laptop 4', 2100),
    ('Laptop', 'Dell', 'XPS 13', 2000),
    ('Laptop', 'Dell', 'XPS 15', 2300),
    ('Laptop', 'Dell', 'XPS 17', 2500),
    ('Earphone', 'Apple', 'AirPods Pro', 280),
    ('Earphone', 'Samsung', 'Galaxy Buds Pro', 220),
    ('Earphone', 'Samsung', 'Galaxy Buds Live', 170),
    ('Earphone', 'Sony', 'WF-1000XM4', 250),
    ('Headphone', 'Sony', 'WH-1000XM4', 400),
    ('Headphone', 'Apple', 'AirPods Max', 550),
    ('Headphone', 'Microsoft', 'Surface Headphones 2', 250),
    ('Smartwatch', 'Apple', 'Apple Watch Series 6', 1000),
    ('Smartwatch', 'Apple', 'Apple Watch SE', 400),
    ('Smartwatch', 'Samsung', 'Galaxy Watch 4', 600),
    ('Smartwatch', 'OnePlus', 'OnePlus Watch', 220);

In [ ]:
select * from product;

<h5> FIRST_VALUE():

In [ ]:
-- Write query to display the most expensive product under each category (corresponding to each record)
select 
    *,
    first_value(product_name) over(partition by product_category order by price desc) as most_exp_product
from product;

<h5> LAST_VALUE():

In [ ]:
-- Write query to display the least expensive product under each category (corresponding to each record)
select 
    *,
    first_value(product_name) 
        over(partition by product_category order by price desc) 
        as most_exp_product,
    last_value(product_name) 
        over(partition by product_category order by price desc
            range between unbounded preceding and unbounded following) 
        as least_exp_product    
from product
WHERE product_category ='Phone';

In [ ]:
-- Alternate way to write SQL query using Window functions
select 
    *,
    first_value(product_name) over w as most_exp_product,
    last_value(product_name) over w as least_exp_product    
from product
WHERE product_category ='Phone'
window w as (partition by product_category order by price desc
            range between unbounded preceding and unbounded following);

<h5> NTH_VALUE():

In [ ]:
-- Write query to display the Second most expensive product under each category.
select 
    *,
    first_value(product_name) over w as most_exp_product,
    last_value(product_name) over w as least_exp_product,
    nth_value(product_name, 5) over w as second_most_exp_product
from product
window w as (partition by product_category order by price desc
            range between unbounded preceding and unbounded following);

<h5> NTILE():

In [ ]:
-- Write a query to segregate all the expensive phones, mid range phones and the cheaper phones.
select x.product_name, 
    case when x.buckets = 1 then 'Expensive Phones'
         when x.buckets = 2 then 'Mid Range Phones'
         when x.buckets = 3 then 'Cheaper Phones' END as Phone_Category
from (
    select *,
    ntile(3) over (order by price desc) as buckets
    from product
    where product_category = 'Phone') x;

<h5> CUME_DIST(...) (cumulative distribution):

In [ ]:
select * from product;

In [ ]:
-- CUME_DIST (cumulative distribution) ; 
/*  Formula = Current Row no (or Row No with value same as current row) / Total no of rows */

-- Query to fetch all products which are constituting the first 30% 
-- of the data in products table based on price.
select product_name, cume_dist_percetage
from (
    select *,
    cume_dist() over (order by price desc) as cume_distribution,
    round(cume_dist() over (order by price desc)::numeric * 100,2)||'%' as cume_dist_percetage
    from product) x
where x.cume_distribution <= 0.3;

In [ ]:
-- PERCENT_RANK (relative rank of the current row / Percentage Ranking)
/* Formula = Current Row No - 1 / Total no of rows - 1 */

-- Query to identify how much percentage more expensive is "Galaxy Z Fold 3" when compared to all products.
select product_name, per
from (
    select *,
    percent_rank() over(order by price) ,
    round(percent_rank() over(order by price)::numeric * 100, 2) as per
    from product) x
where x.product_name='Galaxy Z Fold 3';

#### [Aggregate Function Descriptions](https://dev.mysql.com/doc/refman/8.0/en/aggregate-functions.html)

Aggregate functions in MySQL are used to perform a calculation on a set of values and return a single value. These functions operate on a group of rows and return a summary value. Common aggregate functions include `COUNT()`, `SUM()`, `AVG()`, `MIN()`, and `MAX()`. Aggregate functions are often used with the `GROUP BY` clause to group rows based on one or more columns.Example using an aggregate function:

MySQL provides several aggregate functions that allow you to perform calculations on sets of values and return a single result. Here are some of the most useful MySQL aggregate functions with examples:

1. `COUNT()`: The COUNT() function is used to count the number of rows in a result set.

In [ ]:
SELECT COUNT(*) AS total_employees FROM employees;

2. `SUM()`: The SUM() function calculates the sum of values in a numeric column.

In [ ]:
SELECT SUM(salary) AS total_salary FROM employees;

3. `AVG()`: The AVG() function calculates the average of values in a numeric column.

In [ ]:
SELECT department, AVG(salary) AS avg_salary
FROM employees
GROUP BY department;

4. `MIN()`: The MIN() function retrieves the minimum value from a column.

In [ ]:
SELECT MIN(salary) AS min_salary FROM employees;

5. `MAX()`: The MAX() function retrieves the maximum value from a column.

In [ ]:
SELECT MAX(salary) AS max_salary FROM employees;

6. `GROUP_CONCAT()`: The `GROUP_CONCAT()` function concatenates values from multiple rows into a single string.

In [23]:
SELECT department, GROUP_CONCAT(first_name ORDER BY first_name SEPARATOR ', ') AS employee_list
FROM employee
GROUP BY department;

,department,employee_list
0,None,"Benjamin, David, Justin, Taylor"
1,,"Carol, James, Michael"
2,Finance,"Cynthia, Kristen"
3,HR,", , Joseph, Kristy, Sean"
4,IT,"Caitlyn, Kelly, Rachel, Sean"
5,Marketing,", George, Jeffrey"
6,Sales,", Alvin, Lauren"

7. `GROUP BY`: The GROUP BY clause is used with aggregate functions to group the result set by one or more columns.

In [ ]:
SELECT department, AVG(salary) AS avg_salary
FROM employees
GROUP BY department;

8. `HAVING`: The HAVING clause is used in combination with GROUP BY to filter the result set based on aggregate conditions.

In [ ]:
SELECT department, AVG(salary) AS avg_salary
FROM employees
GROUP BY department
HAVING AVG(salary) > 50000;

9. `DISTINCT`: The DISTINCT keyword is used to eliminate duplicate values in a result set.

In [ ]:
SELECT DISTINCT department FROM employees;

10. `STDDEV()` / `VARIANCE()`: The STDDEV() function calculates the standard deviation of a set of values, and VARIANCE() calculates the variance.

In [ ]:
SELECT STDDEV(salary) AS salary_stddev, VARIANCE(salary) AS salary_variance FROM employees;

#### [Numeric Functions and Operators](https://dev.mysql.com/doc/refman/8.0/en/numeric-functions.html)

MySQL provides a variety of numeric functions and operators that allow you to perform calculations and manipulate numeric data. Here are some of the most useful MySQL numeric functions and operators along with examples:

**Numeric Functions**:

1. `ROUND()`: The ROUND() function rounds a number to a specified number of decimal places.

In [ ]:
SELECT ROUND(salary, 2) AS rounded_salary FROM employee;

2. `CEIL() / FLOOR()`: The CEIL() function returns the smallest integer greater than or equal to a number. The FLOOR() function returns the largest integer less than or equal to a number.

In [ ]:
SELECT CEIL(salary) AS ceil_salary FROM employee;
SELECT FLOOR(salary) AS floor_salary FROM employee;

3. `ABS()`: The ABS() function returns the absolute value of a number.

In [ ]:
SELECT ABS(salary) AS absolute_salary FROM employee;

4. `SQRT()`: The SQRT() function returns the square root of a number.

In [ ]:
SELECT SQRT(salary) AS square_root_salary FROM employees;

5. `RAND()`: The RAND() function generates a random decimal number between 0 and 1.

In [ ]:
SELECT RAND() AS random_number;

**Numeric Operators**:

1. `+`, `-`, `*`, `/`: Basic arithmetic operators for addition, subtraction, multiplication, and division.

In [ ]:
SELECT salary + bonus AS total_income FROM employee;
SELECT salary * 1.1 AS increased_salary FROM employee;

2. `% (MOD)`: The % operator returns the remainder of a division.

In [ ]:
SELECT 15 % 4 AS remainder;

3. `POW()`: The POW() function raises a number to the specified power.

In [ ]:
SELECT POW(salary, 2) AS squared_salary FROM employee;

4. `GREATEST() / LEAST()`: The GREATEST() function returns the greatest value among a list of expressions. The LEAST() function returns the smallest value.

In [ ]:
SELECT GREATEST(salary, bonus, commission) AS max_income FROM employee;
SELECT LEAST(salary, bonus, commission) AS min_income FROM employee;

5. `CAST()`: The CAST() function is used to convert a value from one data type to another.

In [ ]:
SELECT CAST(salary AS SIGNED) AS signed_salary FROM employee;

#### [String Functions and Operators](https://dev.mysql.com/doc/refman/8.0/en/string-functions.html)

MySQL provides a variety of string functions that allow you to manipulate and operate on string data. Here are some of the most useful MySQL string functions along with examples:

  - Upper, lower case

    ```sql
    SELECT UPPER(first_name), LOWER(department), LENGTH(first_name)
    FROM employees;
    ```

  - Length

    ```sql
    SELECT LENGTH(first_name)
    FROM employees;
    ```

  - Trim white space

    ```sql
    SELECT TRIM(' abc    ')
    ```

  - || combine values of 2 columns together

    ```sql
    SELECT first_name || ' ' || last_name AS full_name
    FROM employees;
    ```

  - Substring

    ```sql
    SELECT SUBSTRING('This is test data' FROM 1 FOR 4) -- 'This'
    ```

    ```sql
    SELECT SUBSTRING('This is test data' FROM 9) -- 'test data'
    ```

  - Replace

    ```sql
    SELECT department, REPLACE(department, 'Clothing', 'Attire') AS "modified department"
    FROM departments; -- replace 'Clothing' by 'Attire'
    ```

  - Position

    ```sql
    SELECT POSITION('@' IN email)
    FROM employees;
    ```

    ```sql
    SELECT email, SUBSTRING(email, POSITION('@' IN email) + 1) AS email_domain
    FROM employees;
    ```

  - Coalesce null values

    ```sql
    SELECT email, COALESCE(email, 'NONE') as email_new
    FROM employees;
    ```

1. `CONCAT()`: The CONCAT() function is used to concatenate two or more strings.

In [ ]:
SELECT CONCAT(first_name, ' ', last_name) AS full_name FROM employees;

2. `SUBSTRING()`: The SUBSTRING() function extracts a portion of a string.

In [ ]:
SELECT SUBSTRING(first_name, 1, 5) AS short_name FROM employee;

In [ ]:
SELECT concat(SUBSTRING(first_name, 1, 1), '. ', SUBSTRING(last_name, 1, 5)) AS short_name FROM employee;

3. `UPPER() / LOWER()`: The UPPER() and LOWER() functions convert a string to uppercase or lowercase.

In [ ]:
SELECT UPPER(employee_name) AS upper_name FROM employees;

4. `TRIM()`: The TRIM() function removes leading and trailing spaces from a string.

In [ ]:
SELECT TRIM('   Hello   ') AS trimmed_text;

5. `REPLACE()`: The REPLACE() function replaces occurrences of a specified string with another string.

In [ ]:
SELECT REPLACE(email, '@', '_at_') AS modified_email FROM customers;

6. `LENGTH()`: The LENGTH() function returns the length of a string.

In [19]:
SELECT first_name, LENGTH(first_name) AS name_length FROM Employee;

,first_name,name_length
0,George,6.0
1,David,5.0
2,None,NaN
3,,0.0
4,None,NaN
5,None,NaN
6,Michael,7.0
7,Kristen,7.0
8,Jeffrey,7.0
9,Carol,5.0
10,,0.0
11,Joseph,6.0
12,None,NaN
13,Sean,4.0
14,Justin,6.0
15,Cynthia,7.0
16,Kelly,5.0
17,None,NaN
18,Kristy,6.0
19,Lauren,6.0
20,,0.0
21,Benjamin,8.0
22,Taylor,6.0
23,Sean,4.0
24,James,5.0
25,Caitlyn,7.0
26,Alvin,5.0
27,,0.0
28,Rachel,6.0
29,None,NaN

7. `CONCAT_WS()`: The CONCAT_WS() function concatenates strings with a specified separator.

In [ ]:
SELECT CONCAT_WS('-', year, month, day) AS formatted_date FROM orders;

8. `LEFT() / RIGHT()`: The LEFT() and RIGHT() functions extract a specified number of characters from the left or right of a string.

In [ ]:
SELECT LEFT(product_code, 3) AS short_code FROM products;

9. `INSTR()`: The INSTR() function returns the position of the first occurrence of a substring in a string.

In [ ]:
SELECT INSTR(product_name, 'Apple') AS apple_position FROM products;

10. `FORMAT()`: The FORMAT() function formats a number with commas as a thousand separator.

In [ ]:
SELECT FORMAT(salary, 2) AS formatted_salary FROM employees;

11. `COALESCE()`: It returns the first non-NULL value in a list of expressions. It’s commonly used to handle NULL values by providing a default or substitute value when a NULL is encountered.


```sql
COALESCE(expr1, expr2, ..., exprN)
```

- `expr1, expr2, ..., exprN` are the expressions to check in sequence.
- `COALESCE` evaluates each expression one by one, from left to right, and returns the first expression that is not NULL.
- If all expressions are NULL, `COALESCE` will return NULL.


1. **Handling NULL values with Default Values**  
   When you want to replace NULL values with a default value.

   ```sql
   SELECT COALESCE(address, 'Unknown Address') AS user_address
   FROM users;
   ```
   - Here, if `address` is NULL, the result will be `'Unknown Address'`.

2. **Calculating Values with Potentially NULL Results**  
   When performing calculations that might return NULL, `COALESCE` can substitute a fallback value.

   ```sql
   SELECT user_id,
          COALESCE(SUM(purchase_amount), 0) AS total_spent
   FROM purchases
   GROUP BY user_id;
   ```
   - This will ensure that if a user has no purchases, `total_spent` will be `0` instead of NULL.

3. **Simplifying Conditional Logic**  
   `COALESCE` can replace complex `CASE` statements where the goal is simply to choose the first non-NULL value.

   ```sql
   SELECT COALESCE(phone_number, email, 'No contact info') AS contact_info
   FROM contacts;
   ```
   - This will return `phone_number` if it's not NULL, otherwise `email`, and if both are NULL, it returns `'No contact info'`.

#### [Date and Time Functions](https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html)

MySQL provides a variety of date and time functions to perform operations on date and time values. Here are some of the most useful MySQL date and time functions along with examples:

`NOW()`: Returns the current date and time.

`CURDATE() / CURTIME()`: CURDATE() returns the current date, and CURTIME() returns the current time.

In [ ]:
SELECT CURDATE() AS cdt, CURTIME() AS ctm;

`DATE() / TIME()`: Extracts the date or time part from a datetime value.

In [ ]:
SELECT DATE(NOW()) AS cdt,TIME(NOW()) AS ctm;

`DATEDIFF()`: Calculates the difference between two dates.

In [ ]:
SELECT DATEDIFF('2023-01-01', '2022-01-01') AS days_difference;

`DATE_ADD() / DATE_SUB()`: Adds or subtracts a specified time interval to/from a date.

In [ ]:
SELECT DATE_ADD(NOW(), INTERVAL 7 DAY) AS one_week_later;

`DATE_FORMAT()`: Formats a date as specified.

In [ ]:
-- It may not work in Jupyter Cell, Try on MySQL Shell!!
SELECT DATE_FORMAT(NOW(), '%Y-%m-%d %H:%i:%s') AS formatted_datetime;

`MONTH() / DAY() / YEAR()`: Extracts the month, day, or year from a date.

In [ ]:
SELECT MONTH(NOW()) AS current_month, DAY(NOW()) AS current_day, YEAR(NOW()) AS current_year;

`TIMESTAMPDIFF()`: Calculates the difference between two timestamps in a specified unit.

In [ ]:
SELECT TIMESTAMPDIFF(MINUTE, '2022-01-01 12:00:00', NOW()) AS minutes_difference;

`STR_TO_DATE() / DATE_FORMAT()`: Converts a string to a date or a date to a string.

<b style="color:red">It may not work in Jupyter Cell, Try on MySQL Shell!!</b>

In [ ]:
-- It may not work in Jupyter Cell, Try on MySQL Shell!!
SELECT STR_TO_DATE('2023-01-01', '%Y-%m-%d') AS date1,
       DATE_FORMAT('2023-01-01-11-39-37', '%H:%i:%s') AS time1,
       DATE_FORMAT('2023-01-01-11:39:37', '%H:%i:%s') AS time2,
       DATE_FORMAT(NOW(), '%W, %M %e, %Y') AS formatted_date1,
       DATE_FORMAT(NOW(), '%Y-%m-%d') AS formatted_date2,
       DATE_FORMAT(NOW(), '%H:%i:%s') AS formatted_date3;

`NOW()` + `INTERVAL`: Allows you to add a specific interval to the current date and time.

In [ ]:
SELECT NOW() + INTERVAL 1 HOUR AS one_hour_later;

### Database Administration

- [7 Must-know Strategies to Scale Your Database](https://www.youtube.com/watch?v=_1IKwnbscQU)

<b style="font-size:18px;color:#C71585">DELIMITER</b>: In SQL, the **DELIMITER** command is used to change the default statement delimiter, which is typically a semicolon (`;`). When you define stored procedures, triggers, or other constructs in SQL that contain multiple statements, you may need to change the delimiter temporarily to avoid premature termination of the statement.

The DELIMITER `//` command is often used when defining triggers, stored procedures, or functions in MySQL and some other database systems. It changes the delimiter to `//` (double forward slash) instead of the default semicolon, allowing you to use semicolons within the body of the trigger or stored procedure without confusing the SQL parser.

##### Stored Procedure

In [ ]:
SELECT ROUTINE_NAME, ROUTINE_TYPE
FROM information_schema.ROUTINES
WHERE ROUTINE_SCHEMA = 'interview_questions';

- It gets run from the sql script although it does not in the jupyter cell!!!!

```sql
USE interview_questions;

DELIMITER //

CREATE PROCEDURE `GetLastFiveEmployees`()
BEGIN
  SELECT * 
  FROM Employee
  ORDER BY employee_id DESC
  LIMIT 5;
END//

DELIMITER ;
```

In [ ]:

-- Invoke the stored procedure
CALL GetLastFiveEmployees();

In [ ]:
SELECT ROUTINE_NAME, ROUTINE_TYPE
FROM information_schema.ROUTINES
WHERE ROUTINE_SCHEMA = 'interview_questions';

In [ ]:
SELECT ROUTINE_NAME
FROM information_schema.ROUTINES
WHERE ROUTINE_SCHEMA = 'interview_questions'
AND ROUTINE_TYPE = 'PROCEDURE';

```sql
DROP PROCEDURE IF EXISTS GetLastFiveEmployees;
```

##### Trigger

In the context of a relational database management system (RDBMS), a trigger is a predefined action that is automatically executed (or "triggered") in response to certain events on a particular table or view. These events could include actions like INSERT, UPDATE, DELETE, or a combination of them.

Triggers are typically used to enforce business rules, data integrity, or to automate tasks that need to occur alongside data modifications. Here are some key points about triggers:


- **Event Types**:

    - `BEFORE Triggers`: Executed before the specified event (e.g., BEFORE INSERT).
    - `AFTER Triggers`: Executed after the specified event (e.g., AFTER UPDATE).

- **Event Actions**:

    - `INSERT Trigger`: Fires before or after a new row is inserted into a table.
    - `UPDATE Trigger`: Fires before or after an existing row is updated.
    - `DELETE Trigger`: Fires before or after a row is deleted.

- **Use Cases**:

    - `Enforcing Constraints`: Triggers can be used to check and enforce data integrity constraints before allowing changes to the database.
    - `Auditing Changes`: Triggers can log changes made to specific tables for auditing purposes.
Derived Column Values: Triggers can be used to automatically populate or update certain columns based on other column values.

- **Syntax**:

The syntax for creating triggers varies between database systems (e.g., MySQL, PostgreSQL, Oracle), but generally involves specifying the triggering event, the table affected, and the action to be taken.

- Triggers are stored programs that get automatically executed when an event such as INSERT, DELETE, UPDATE(DML) statement occurs. Triggers can also be evoked in response to Data definition statements(DDL) and database operations, for example, SERVER ERROR, LOGON.

In [ ]:
select * from Employee;

In [ ]:
DROP TRIGGER IF EXISTS update_log;

In [ ]:
CREATE TABLE change_log (
    log_id INT AUTO_INCREMENT PRIMARY KEY,
    employee_id INT,
    change_description VARCHAR(255),
    change_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

In [ ]:
CREATE TRIGGER update_log
AFTER UPDATE ON Employee
FOR EACH ROW
INSERT INTO change_log (employee_id, change_description)
VALUES (OLD.employee_id, 'Employee data updated');

In [ ]:
SELECT TRIGGER_NAME, EVENT_OBJECT_TABLE, ACTION_TIMING, EVENT_MANIPULATION
FROM information_schema.TRIGGERS
WHERE TRIGGER_SCHEMA = 'interview_questions';

In [ ]:
INSERT INTO Employee (FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT,MANAGER_ID) VALUES
	('James', 'Smith', 100000, '17-02-20 09.00.00', 'HR', 002);

In [ ]:
UPDATE Employee
SET FIRST_NAME = 'Adam'
WHERE employee_id = 12;

In [ ]:
SELECT * FROM change_log;

In [ ]:
DELIMITER //

CREATE TRIGGER update_timestamp
BEFORE UPDATE ON orders
FOR EACH ROW
SET NEW.last_modified = NOW();

//

DELIMITER ;

##### Cursore

a cursor is a database object that enables you to traverse the result set of a query and process each row individually. Cursors are typically used within stored procedures, triggers, or functions where you need to iterate over a set of rows returned by a query.

In [ ]:
-- NOT WORKING YET !!!!
DELIMITER //

CREATE PROCEDURE PrintEmployeeData()
BEGIN
    DECLARE EMPLOYEE_ID INT;
    DECLARE FIRST_NAME VARCHAR(100);
    DECLARE JOINING_DATE VARCHAR(100);
    DECLARE Counter INT;
    
    SET Counter = 1;
    
    DECLARE PrintEmployees CURSOR FOR
        SELECT EMPLOYEE_ID, FIRST_NAME, JOINING_DATE FROM Employee;
    ;

    OPEN PrintEmployees;
    
    FETCH PrintEmployees INTO EMPLOYEE_ID, FIRST_NAME, JOINING_DATE;
    
    WHILE @@FETCH_STATUS = 0 DO
        IF Counter = 1 THEN
            SELECT 'EMPLOYEE_ID' AS EMPLOYEE_ID, 'FIRST_NAME' AS FIRST_NAME, 'JOINING_DATE' AS JOINING_DATE;
            SELECT '------------------------------------';
        END IF;
        
        SELECT CAST(EMPLOYEE_ID AS CHAR(10)) AS EMPLOYEE_ID, FIRST_NAME, JOINING_DATE;
        
        SET Counter = Counter + 1;
        
        FETCH PrintEmployees INTO EMPLOYEE_ID, FIRST_NAME, JOINING_DATE;
    END WHILE;
    
    CLOSE PrintEmployees;
END //

DELIMITER ;

##### TRANSACTION

a transaction is a logical unit of work that consists of one or more SQL operations (queries, updates, inserts, deletes) executed as a single, atomic unit. Transactions are used to ensure the integrity, consistency, and reliability of data within a database. They follow the principles of the ACID properties: Atomicity, Consistency, Isolation, and Durability.

In [ ]:
BEGIN; -- Start the transaction
UPDATE Accounts SET Balance = Balance - 100 WHERE AccountID = 123; -- Deduct $100
UPDATE Transactions SET Status = 'Completed' WHERE TransactionID = 456; -- Mark the transaction as completed

COMMIT; -- Commit the changes

##### SAVEPOINT

- A SAVEPOINT is a point in a transaction when you can roll the transaction back to a certain point without rolling back the entire transaction.

```sql
SQL> SAVEPOINT A
SQL> INSERT INTO TEST VALUES (1,'Savepoint A');
    1 row inserted.
SQL> SAVEPOINT B
SQL> INSERT INTO TEST VALUES (2,'Savepoint B');
    1 row inserted.
SQL> ROLLBACK TO B;
    Rollback complete.
SQL> SELECT * FROM TEST;
    ID MSG
```

##### COMMIT


- When a COMMIT is used in a transaction all changes made in the transaction are written into the database permanently.

```sql
BEGIN TRANSACTION;
DELETE FROM HumanResources.JobCandidate
WHERE JobCandidateID = 13;
COMMIT TRANSACTION;
```

- The above example deletes a job candidate in a SQL server.